{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Loading data into neo4j\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "# from neo4j import GraphDatabase\n",
    "\n",
    "# class Neo4jConnect:\n",
    "#     def __init__(self, user, password):\n",
    "#         self.driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=(user, password))\n",
    "#         self.user = user\n",
    "#     def close(self):\n",
    "#         self.driver.close()\n",
    "        \n",
    "#     def query(self, query):\n",
    "#         session = self.driver.session(database=\"cran\")\n",
    "#         result = session.run(query)\n",
    "#         return result\n",
    "    \n",
    "#     def clean_database(self):\n",
    "#         \"\"\"\n",
    "#         Delete all nodes and edge in Neo4j test container\n",
    "#         \"\"\"\n",
    "#         q = \"MATCH (n) DETACH DELETE (n)\"\n",
    "#         try:\n",
    "#             session = self.driver.session()\n",
    "#             session.run(q)\n",
    "#         except Exception as e:\n",
    "#             print(e)\n",
    "    \n",
    "#     def test_neo4j_connection(self):\n",
    "#         \"\"\"Test neo4j connection\n",
    "#         \"\"\"\n",
    "#         session = self.driver.session()\n",
    "#         result = session.run(\"Match () Return 1 Limit 1\")\n",
    "#         return result\n",
    "#     def __str__(self):\n",
    "#         return f'Connection successful for user: {self.user}.\\nConnected to Neo4J database uri: {self.uri}'\n",
    "    \n",
    "# connection = Neo4jConnect('admin', 'cran2graph')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "## Setting up connections\n",
    "\n",
    "from graphutils.utils import Neo4jConnect\n",
    "\n",
    "connection = Neo4jConnect('admin', 'cran2graph')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'a': {'person': 'Jing Zhang'},\n",
       "  'p': {'license': 'GPL-3',\n",
       "   'package': 'do',\n",
       "   'md5sum': 'f89af897b6b03444fdfa63d91d51ef0a',\n",
       "   'description': 'Flexibly convert data between long and wide format using just two\\n    functions: reshape_toLong() and reshape_toWide().',\n",
       "   'embedding': [-0.0113023175,\n",
       "    0.006359398,\n",
       "    0.020583203,\n",
       "    0.0054372116,\n",
       "    -0.014135274,\n",
       "    -0.0066286763,\n",
       "    0.0031225234,\n",
       "    -0.005330238,\n",
       "    -0.020538937,\n",
       "    -0.012977008,\n",
       "    0.033611853,\n",
       "    0.014297579,\n",
       "    0.0047252835,\n",
       "    0.0053671254,\n",
       "    -0.017425636,\n",
       "    0.005754444,\n",
       "    0.002135784,\n",
       "    -0.009834196,\n",
       "    -0.0063667754,\n",
       "    0.0060200333,\n",
       "    0.026131077,\n",
       "    0.010498171,\n",
       "    -0.003733011,\n",
       "    0.019963494,\n",
       "    -0.007798009,\n",
       "    0.01820765,\n",
       "    0.021837376,\n",
       "    -0.008889877,\n",
       "    0.014459884,\n",
       "    -0.008063599,\n",
       "    0.02297351,\n",
       "    -0.013102425,\n",
       "    -0.00089867075,\n",
       "    -0.029908352,\n",
       "    1.8904822e-05,\n",
       "    -0.016525581,\n",
       "    -0.0031317454,\n",
       "    -0.011132635,\n",
       "    0.02667701,\n",
       "    -0.015891118,\n",
       "    0.049134094,\n",
       "    0.006809425,\n",
       "    -0.0026005658,\n",
       "    0.012313033,\n",
       "    0.0010273157,\n",
       "    0.012357299,\n",
       "    -0.00679467,\n",
       "    -0.03597265,\n",
       "    0.01355983,\n",
       "    0.038303938,\n",
       "    0.022029191,\n",
       "    0.017056761,\n",
       "    -0.0076725916,\n",
       "    0.00039630965,\n",
       "    -0.010564568,\n",
       "    -0.013013896,\n",
       "    0.0016590134,\n",
       "    0.030896936,\n",
       "    -0.0012467961,\n",
       "    -0.019624129,\n",
       "    0.009782555,\n",
       "    0.010645721,\n",
       "    -0.033582345,\n",
       "    0.008417718,\n",
       "    -0.021129137,\n",
       "    -0.020406142,\n",
       "    -0.014068877,\n",
       "    0.023578463,\n",
       "    0.0060274107,\n",
       "    0.00882348,\n",
       "    0.014327089,\n",
       "    0.019491334,\n",
       "    0.016097687,\n",
       "    0.012445829,\n",
       "    0.015979648,\n",
       "    -0.024463763,\n",
       "    -0.03614971,\n",
       "    0.021055361,\n",
       "    -0.010276847,\n",
       "    -0.018045345,\n",
       "    0.0037514546,\n",
       "    -0.032962635,\n",
       "    0.0053671254,\n",
       "    0.018650299,\n",
       "    -0.0032424077,\n",
       "    0.0032756063,\n",
       "    -0.032077335,\n",
       "    0.02170458,\n",
       "    -0.00035158359,\n",
       "    -0.03638579,\n",
       "    0.046537217,\n",
       "    0.0039727795,\n",
       "    0.023681749,\n",
       "    0.015832098,\n",
       "    0.017661715,\n",
       "    0.005673291,\n",
       "    -0.0022907113,\n",
       "    0.027016375,\n",
       "    -0.014135274,\n",
       "    0.005540496,\n",
       "    0.00046409035,\n",
       "    0.024021113,\n",
       "    -0.018635545,\n",
       "    -0.016319012,\n",
       "    -0.044117402,\n",
       "    -0.014142652,\n",
       "    0.024596557,\n",
       "    -0.019284764,\n",
       "    0.008225904,\n",
       "    0.028167265,\n",
       "    -0.015050083,\n",
       "    0.028329568,\n",
       "    0.012394186,\n",
       "    -0.032785572,\n",
       "    0.021335706,\n",
       "    -0.006141762,\n",
       "    0.02273743,\n",
       "    -0.010667853,\n",
       "    -0.0037256335,\n",
       "    -0.011818742,\n",
       "    0.016555091,\n",
       "    0.012755684,\n",
       "    0.018369954,\n",
       "    -0.02270792,\n",
       "    0.020494672,\n",
       "    -0.00063031446,\n",
       "    -0.022088211,\n",
       "    -0.024021113,\n",
       "    -0.011280185,\n",
       "    -0.012453206,\n",
       "    0.02611632,\n",
       "    0.0051199794,\n",
       "    0.040546697,\n",
       "    -0.0040428657,\n",
       "    0.023726014,\n",
       "    0.014865646,\n",
       "    0.005488854,\n",
       "    -0.015109103,\n",
       "    -0.015197633,\n",
       "    -0.0097678,\n",
       "    0.02276694,\n",
       "    0.01800108,\n",
       "    -0.035175882,\n",
       "    -0.015625527,\n",
       "    -0.018812604,\n",
       "    0.00078846945,\n",
       "    0.016156707,\n",
       "    0.003788342,\n",
       "    0.021896396,\n",
       "    -0.01829618,\n",
       "    0.016127197,\n",
       "    -0.0364153,\n",
       "    0.030837916,\n",
       "    0.013368015,\n",
       "    0.017455146,\n",
       "    0.0015243742,\n",
       "    0.013486055,\n",
       "    0.0007004006,\n",
       "    -0.00664712,\n",
       "    -0.005507298,\n",
       "    -0.010689986,\n",
       "    0.011981047,\n",
       "    0.016982986,\n",
       "    0.025260532,\n",
       "    0.010321111,\n",
       "    0.0031114572,\n",
       "    0.01141298,\n",
       "    -0.030188696,\n",
       "    0.000628009,\n",
       "    -0.002655897,\n",
       "    -0.009494832,\n",
       "    -0.012844213,\n",
       "    -0.031988803,\n",
       "    -0.0029509966,\n",
       "    0.020199573,\n",
       "    0.003976468,\n",
       "    0.0142680695,\n",
       "    -0.02779839,\n",
       "    -0.032490473,\n",
       "    0.0018526727,\n",
       "    0.020125797,\n",
       "    0.015138613,\n",
       "    0.027621329,\n",
       "    0.027488535,\n",
       "    -0.0007193055,\n",
       "    -0.0045666676,\n",
       "    0.027134415,\n",
       "    -0.007665214,\n",
       "    0.006477438,\n",
       "    0.021896396,\n",
       "    0.027518045,\n",
       "    0.022752184,\n",
       "    -0.01397297,\n",
       "    -0.008425096,\n",
       "    -0.5481772,\n",
       "    -0.009125957,\n",
       "    -0.0028956656,\n",
       "    -0.03594314,\n",
       "    -0.009103825,\n",
       "    -0.01817814,\n",
       "    -0.015861608,\n",
       "    0.03744815,\n",
       "    -0.006230292,\n",
       "    0.013759023,\n",
       "    -0.026691765,\n",
       "    0.020775016,\n",
       "    0.020789772,\n",
       "    -0.03913022,\n",
       "    -0.029008297,\n",
       "    0.00054178457,\n",
       "    0.00292702,\n",
       "    -0.015359938,\n",
       "    -0.009243998,\n",
       "    0.01732235,\n",
       "    -0.034113523,\n",
       "    0.03703501,\n",
       "    -0.0020601647,\n",
       "    -0.0046920846,\n",
       "    -0.006591789,\n",
       "    0.007023372,\n",
       "    0.019609373,\n",
       "    -0.0223538,\n",
       "    0.027547555,\n",
       "    0.032992143,\n",
       "    -0.017425636,\n",
       "    0.028049223,\n",
       "    0.007218876,\n",
       "    -0.016378032,\n",
       "    0.042494353,\n",
       "    0.014452507,\n",
       "    -0.028742708,\n",
       "    0.012305656,\n",
       "    0.028772218,\n",
       "    0.018989664,\n",
       "    -0.023180079,\n",
       "    -0.01114739,\n",
       "    0.02282596,\n",
       "    0.011634304,\n",
       "    -0.0018397621,\n",
       "    0.002665119,\n",
       "    1.4373141e-05,\n",
       "    -0.0031317454,\n",
       "    0.000484609,\n",
       "    -0.031693704,\n",
       "    -0.0056843576,\n",
       "    0.0009830508,\n",
       "    0.013013896,\n",
       "    -0.011582662,\n",
       "    0.009915349,\n",
       "    0.014327089,\n",
       "    0.02344567,\n",
       "    -0.0004984418,\n",
       "    -0.011877762,\n",
       "    0.003511686,\n",
       "    -0.013249976,\n",
       "    0.029273888,\n",
       "    -0.022043945,\n",
       "    0.001211753,\n",
       "    -0.002532324,\n",
       "    -0.0091776,\n",
       "    0.0064257956,\n",
       "    0.015625527,\n",
       "    0.0016110598,\n",
       "    -0.0016461029,\n",
       "    -0.0030376823,\n",
       "    0.03550049,\n",
       "    0.02729672,\n",
       "    -0.0027757813,\n",
       "    0.025599897,\n",
       "    0.04553388,\n",
       "    0.014754984,\n",
       "    0.01338277,\n",
       "    -0.0035338185,\n",
       "    0.030690366,\n",
       "    0.024581803,\n",
       "    0.009273508,\n",
       "    -0.011973669,\n",
       "    0.006458994,\n",
       "    0.020819282,\n",
       "    0.013980347,\n",
       "    0.0125417365,\n",
       "    -0.018310934,\n",
       "    -0.011693325,\n",
       "    -0.031634685,\n",
       "    0.016038667,\n",
       "    0.021970171,\n",
       "    0.0018582058,\n",
       "    -0.06498095,\n",
       "    -0.007429134,\n",
       "    0.039808948,\n",
       "    -0.03340528,\n",
       "    0.00020726142,\n",
       "    0.013368015,\n",
       "    0.0042605014,\n",
       "    -0.014164784,\n",
       "    0.026249116,\n",
       "    0.0142680695,\n",
       "    0.021970171,\n",
       "    -0.019166723,\n",
       "    0.03550049,\n",
       "    -0.0115605295,\n",
       "    0.014518904,\n",
       "    0.019343784,\n",
       "    -0.0065253917,\n",
       "    -0.011516265,\n",
       "    -0.010697363,\n",
       "    -0.023268608,\n",
       "    -0.0012975164,\n",
       "    0.0017281774,\n",
       "    -0.04497319,\n",
       "    0.01741088,\n",
       "    -0.019137213,\n",
       "    -0.003056126,\n",
       "    -0.014378732,\n",
       "    -0.001414634,\n",
       "    0.006067987,\n",
       "    0.009944859,\n",
       "    0.0034637323,\n",
       "    0.020538937,\n",
       "    0.00920711,\n",
       "    0.021630807,\n",
       "    -0.0013629916,\n",
       "    -0.015596018,\n",
       "    0.007432823,\n",
       "    -0.0018729607,\n",
       "    -0.008152128,\n",
       "    0.021084871,\n",
       "    -0.017573185,\n",
       "    0.007960314,\n",
       "    0.030896936,\n",
       "    0.0030948578,\n",
       "    -0.0056954236,\n",
       "    0.0059278146,\n",
       "    -0.023666995,\n",
       "    -0.008196393,\n",
       "    0.004227303,\n",
       "    0.022014435,\n",
       "    -0.060436413,\n",
       "    -0.0016442585,\n",
       "    -0.012202372,\n",
       "    -0.017765,\n",
       "    0.014459884,\n",
       "    0.0155369975,\n",
       "    0.013803287,\n",
       "    -0.022088211,\n",
       "    -0.032638025,\n",
       "    -0.03544147,\n",
       "    0.0020656977,\n",
       "    0.015182878,\n",
       "    -0.021778356,\n",
       "    0.0060569206,\n",
       "    -0.019358538,\n",
       "    -0.022368556,\n",
       "    -0.035736572,\n",
       "    0.020597957,\n",
       "    0.011103125,\n",
       "    -0.015101726,\n",
       "    -0.011449867,\n",
       "    -0.029436193,\n",
       "    -0.002279645,\n",
       "    -0.02250135,\n",
       "    0.03617922,\n",
       "    0.010107164,\n",
       "    -0.04444201,\n",
       "    0.015610773,\n",
       "    -0.025998281,\n",
       "    -0.029805068,\n",
       "    -0.00461831,\n",
       "    -0.013028651,\n",
       "    0.040281106,\n",
       "    -0.018547015,\n",
       "    -0.0014321556,\n",
       "    -0.02291449,\n",
       "    -0.020996341,\n",
       "    0.017337106,\n",
       "    0.029318152,\n",
       "    -0.05406226,\n",
       "    -0.008299679,\n",
       "    0.020730752,\n",
       "    -0.003788342,\n",
       "    -0.016687887,\n",
       "    -0.017366616,\n",
       "    -0.024817882,\n",
       "    0.028344324,\n",
       "    -0.023489933,\n",
       "    0.025053963,\n",
       "    -0.0038842494,\n",
       "    -0.0060790535,\n",
       "    0.025747446,\n",
       "    -0.0025397015,\n",
       "    -0.01108837,\n",
       "    -0.0006072598,\n",
       "    0.004079753,\n",
       "    0.0007294495,\n",
       "    0.029996881,\n",
       "    0.010092408,\n",
       "    -0.014408242,\n",
       "    -0.0043785414,\n",
       "    0.012888478,\n",
       "    0.0044486276,\n",
       "    -0.00208783,\n",
       "    -0.0152714085,\n",
       "    0.004732661,\n",
       "    0.016466562,\n",
       "    -0.019771678,\n",
       "    -0.030778896,\n",
       "    -0.022663655,\n",
       "    0.0019402803,\n",
       "    -0.0005062804,\n",
       "    0.039779436,\n",
       "    0.021084871,\n",
       "    0.00072437746,\n",
       "    -0.0012689286,\n",
       "    -0.0011748655,\n",
       "    -0.0062376694,\n",
       "    -0.035618532,\n",
       "    0.0152714085,\n",
       "    0.011604794,\n",
       "    -0.0083218105,\n",
       "    0.01126543,\n",
       "    -0.010564568,\n",
       "    0.006695074,\n",
       "    0.020170063,\n",
       "    -0.018768338,\n",
       "    0.016850192,\n",
       "    -0.011700702,\n",
       "    -0.01350081,\n",
       "    -0.0007156167,\n",
       "    0.0042014816,\n",
       "    -0.02629338,\n",
       "    0.034438133,\n",
       "    -0.03762521,\n",
       "    0.016082931,\n",
       "    -0.008270169,\n",
       "    0.0074844654,\n",
       "    0.009288263,\n",
       "    0.029982127,\n",
       "    -0.008299679,\n",
       "    -0.0030100166,\n",
       "    -0.008801348,\n",
       "    0.01844373,\n",
       "    0.041195914,\n",
       "    -0.016348522,\n",
       "    -0.0024198173,\n",
       "    -0.0085874,\n",
       "    0.02691309,\n",
       "    -0.0137664,\n",
       "    -0.0195356,\n",
       "    0.031900275,\n",
       "    -0.019432314,\n",
       "    0.017750245,\n",
       "    0.028757464,\n",
       "    -0.0025747446,\n",
       "    0.023666995,\n",
       "    0.0150205735,\n",
       "    0.021099627,\n",
       "    -0.01829618,\n",
       "    0.009376792,\n",
       "    0.011818742,\n",
       "    -0.040399145,\n",
       "    0.024994943,\n",
       "    -0.034998823,\n",
       "    -0.015315673,\n",
       "    0.0031446558,\n",
       "    -0.018709319,\n",
       "    -0.02738525,\n",
       "    0.011840874,\n",
       "    -0.031900275,\n",
       "    -0.004489204,\n",
       "    0.0059757684,\n",
       "    0.015950138,\n",
       "    0.0030579704,\n",
       "    0.0051015355,\n",
       "    0.022250516,\n",
       "    -0.01773549,\n",
       "    -0.0060421657,\n",
       "    0.029834578,\n",
       "    0.008019334,\n",
       "    -0.011014596,\n",
       "    -0.023253854,\n",
       "    -0.024626067,\n",
       "    -0.0046773297,\n",
       "    -0.008557891,\n",
       "    0.013567207,\n",
       "    0.015596018,\n",
       "    -0.002908576,\n",
       "    0.014400864,\n",
       "    0.024788372,\n",
       "    -0.012755684,\n",
       "    0.010498171,\n",
       "    0.013626227,\n",
       "    -0.009214487,\n",
       "    0.0049761184,\n",
       "    -0.023711259,\n",
       "    0.019845452,\n",
       "    0.025511367,\n",
       "    -0.006326199,\n",
       "    -0.0076135714,\n",
       "    0.034939803,\n",
       "    0.025068717,\n",
       "    -0.0035227523,\n",
       "    0.00045463795,\n",
       "    0.003377047,\n",
       "    -0.012180239,\n",
       "    -0.0039690905,\n",
       "    -0.030159187,\n",
       "    -0.018768338,\n",
       "    -0.019358538,\n",
       "    -0.010697363,\n",
       "    -0.03402499,\n",
       "    0.009339904,\n",
       "    0.0012089865,\n",
       "    0.014400864,\n",
       "    -0.02744427,\n",
       "    -0.019240499,\n",
       "    -0.050432533,\n",
       "    -0.028270548,\n",
       "    0.028905014,\n",
       "    0.0017779756,\n",
       "    0.058813363,\n",
       "    0.003150189,\n",
       "    0.002438261,\n",
       "    -0.012445829,\n",
       "    -0.0067614713,\n",
       "    -0.022088211,\n",
       "    -0.026086811,\n",
       "    -0.0028477118,\n",
       "    -0.0025489235,\n",
       "    -0.02291449,\n",
       "    -0.0034655768,\n",
       "    0.01764696,\n",
       "    -0.019594619,\n",
       "    -0.007724234,\n",
       "    0.005167933,\n",
       "    -0.0147844935,\n",
       "    -0.025068717,\n",
       "    0.008631665,\n",
       "    -0.0019255254,\n",
       "    -0.017278086,\n",
       "    0.0142902015,\n",
       "    0.038097367,\n",
       "    0.008115241,\n",
       "    0.026131077,\n",
       "    -0.01167857,\n",
       "    0.028964033,\n",
       "    0.014216427,\n",
       "    0.0066323653,\n",
       "    0.009140712,\n",
       "    -0.0025157246,\n",
       "    0.0019771678,\n",
       "    0.022102965,\n",
       "    0.02329812,\n",
       "    -0.030896936,\n",
       "    0.028078735,\n",
       "    0.01726333,\n",
       "    -0.003594683,\n",
       "    0.018074855,\n",
       "    0.017986326,\n",
       "    0.007886539,\n",
       "    0.0030524372,\n",
       "    -0.002458549,\n",
       "    2.2507114e-05,\n",
       "    0.011073615,\n",
       "    -0.014194294,\n",
       "    -0.034998823,\n",
       "    0.05332451,\n",
       "    -0.01794206,\n",
       "    -0.0017327884,\n",
       "    0.022958755,\n",
       "    -0.020066777,\n",
       "    -0.027459025,\n",
       "    0.0075693065,\n",
       "    0.014998441,\n",
       "    0.010660476,\n",
       "    -0.011870384,\n",
       "    -0.03491029,\n",
       "    -0.0015391292,\n",
       "    -0.03727109,\n",
       "    0.018458484,\n",
       "    -0.012586001,\n",
       "    -0.011331827,\n",
       "    -0.019801188,\n",
       "    0.014607434,\n",
       "    0.0004613238,\n",
       "    -0.07466022,\n",
       "    -0.0016673132,\n",
       "    -0.038658056,\n",
       "    0.00056391704,\n",
       "    -0.010756383,\n",
       "    -0.029642763,\n",
       "    -0.012490094,\n",
       "    0.026470441,\n",
       "    0.0071451007,\n",
       "    0.0012901389,\n",
       "    0.016555091,\n",
       "    -0.0031354341,\n",
       "    -0.0057691988,\n",
       "    -0.0038436733,\n",
       "    0.013567207,\n",
       "    -0.03446764,\n",
       "    -0.017499411,\n",
       "    -0.028595159,\n",
       "    0.035736572,\n",
       "    -0.0014312334,\n",
       "    0.010785894,\n",
       "    -0.0272377,\n",
       "    0.006097497,\n",
       "    0.032697044,\n",
       "    0.00063215883,\n",
       "    0.01829618,\n",
       "    0.008624288,\n",
       "    0.0067024515,\n",
       "    -0.017366616,\n",
       "    -0.0014026456,\n",
       "    0.0180601,\n",
       "    -0.0026909402,\n",
       "    -0.015345183,\n",
       "    -0.0063704643,\n",
       "    -0.0028016025,\n",
       "    -0.019299518,\n",
       "    -0.014231182,\n",
       "    0.0032202753,\n",
       "    -0.0048396345,\n",
       "    0.0070159947,\n",
       "    0.021261932,\n",
       "    -5.925048e-05,\n",
       "    -0.027518045,\n",
       "    -0.004570356,\n",
       "    0.012099086,\n",
       "    -0.00452978,\n",
       "    -0.00026282316,\n",
       "    0.014223805,\n",
       "    0.03623824,\n",
       "    -0.0012043755,\n",
       "    0.005208509,\n",
       "    -0.013050783,\n",
       "    -0.020022513,\n",
       "    -0.0047732373,\n",
       "    0.0058319075,\n",
       "    -0.0073811808,\n",
       "    0.004374853,\n",
       "    0.01150151,\n",
       "    -0.033729892,\n",
       "    0.020656977,\n",
       "    -0.008343943,\n",
       "    -0.033641364,\n",
       "    -0.028786974,\n",
       "    0.030749386,\n",
       "    0.010003879,\n",
       "    0.00061233185,\n",
       "    0.0036426366,\n",
       "    -0.0061343843,\n",
       "    -0.018045345,\n",
       "    0.00891201,\n",
       "    -0.0097973095,\n",
       "    0.024124399,\n",
       "    0.019181479,\n",
       "    -0.009922726,\n",
       "    0.0008788437,\n",
       "    -0.015404203,\n",
       "    -0.0026190097,\n",
       "    0.0066434313,\n",
       "    -0.03777276,\n",
       "    -0.021689827,\n",
       "    -0.028580403,\n",
       "    -0.010830158,\n",
       "    0.003876872,\n",
       "    0.031369094,\n",
       "    0.013685247,\n",
       "    -0.016938722,\n",
       "    0.02256037,\n",
       "    -0.018074855,\n",
       "    -0.014828758,\n",
       "    -0.021306196,\n",
       "    -0.018738829,\n",
       "    -0.012873723,\n",
       "    0.011191655,\n",
       "    0.0098194415,\n",
       "    0.057426397,\n",
       "    -0.015610773,\n",
       "    0.0130434055,\n",
       "    0.02270792,\n",
       "    0.0034803317,\n",
       "    0.0010706586,\n",
       "    0.0018775717,\n",
       "    -0.0028108244,\n",
       "    -0.033670872,\n",
       "    -0.001216364,\n",
       "    0.037241578,\n",
       "    0.025511367,\n",
       "    -0.007628327,\n",
       "    -0.009096447,\n",
       "    0.0025876553,\n",
       "    -0.0019365916,\n",
       "    -0.017484656,\n",
       "    -0.019491334,\n",
       "    -0.005492543,\n",
       "    -0.05459344,\n",
       "    -0.012276147,\n",
       "    0.015035328,\n",
       "    -0.011472,\n",
       "    -0.010284224,\n",
       "    -0.028919768,\n",
       "    -0.012755684,\n",
       "    0.022575125,\n",
       "    -0.016820682,\n",
       "    0.017779754,\n",
       "    0.042228762,\n",
       "    0.011309695,\n",
       "    0.007930804,\n",
       "    0.03008541,\n",
       "    0.0048728334,\n",
       "    0.01817814,\n",
       "    -0.012062199,\n",
       "    -0.009775177,\n",
       "    -0.04506172,\n",
       "    0.00078063086,\n",
       "    0.014327089,\n",
       "    -0.009096447,\n",
       "    0.03682844,\n",
       "    0.023858808,\n",
       "    -0.014304956,\n",
       "    0.014017235,\n",
       "    0.015035328,\n",
       "    -0.05627551,\n",
       "    -0.00074143795,\n",
       "    0.0044633825,\n",
       "    -0.03334626,\n",
       "    0.019786432,\n",
       "    -0.032313414,\n",
       "    -0.016274747,\n",
       "    -0.032165863,\n",
       "    0.014415619,\n",
       "    0.015773078,\n",
       "    -0.017396126,\n",
       "    0.026455685,\n",
       "    -0.029524723,\n",
       "    -0.04302553,\n",
       "    -0.010749006,\n",
       "    -0.0044338726,\n",
       "    0.034320094,\n",
       "    0.015109103,\n",
       "    0.0390712,\n",
       "    0.04615359,\n",
       "    -0.0030339935,\n",
       "    -0.016791172,\n",
       "    0.015492733,\n",
       "    0.005197443,\n",
       "    -0.005344993,\n",
       "    0.0217636,\n",
       "    0.0026226984,\n",
       "    -0.03476274,\n",
       "    -0.0023128437,\n",
       "    0.00025106527,\n",
       "    -0.014009857,\n",
       "    -0.032106843,\n",
       "    -0.01888638,\n",
       "    0.012099086,\n",
       "    -0.008402963,\n",
       "    0.0060458547,\n",
       "    -0.019520843,\n",
       "    -0.005330238,\n",
       "    -0.01814863,\n",
       "    0.023607973,\n",
       "    -0.009140712,\n",
       "    0.000489681,\n",
       "    -0.0033088052,\n",
       "    0.007362737,\n",
       "    0.01767647,\n",
       "    0.032667533,\n",
       "    0.001063281,\n",
       "    -0.011066237,\n",
       "    0.029967371,\n",
       "    -0.008948898,\n",
       "    -0.0068463124,\n",
       "    -0.007738989,\n",
       "    0.0044154287,\n",
       "    0.0029805067,\n",
       "    -0.0032553184,\n",
       "    0.0346447,\n",
       "    -0.0017696759,\n",
       "    0.00885299,\n",
       "    0.02794594,\n",
       "    0.007694724,\n",
       "    -0.032254394,\n",
       "    -0.023283364,\n",
       "    -0.02332763,\n",
       "    0.032490473,\n",
       "    -0.043261614,\n",
       "    0.005013006,\n",
       "    0.018768338,\n",
       "    0.01885687,\n",
       "    0.015861608,\n",
       "    -0.01906344,\n",
       "    -0.016245237,\n",
       "    -0.011486755,\n",
       "    0.009664514,\n",
       "    0.010955576,\n",
       "    0.03550049,\n",
       "    -0.010387508,\n",
       "    0.0077463663,\n",
       "    -0.0358251,\n",
       "    -0.001597227,\n",
       "    0.023681749,\n",
       "    -0.020155307,\n",
       "    0.0015105414,\n",
       "    0.02297351,\n",
       "    -0.017986326,\n",
       "    0.009856329,\n",
       "    0.039218746,\n",
       "    -0.019284764,\n",
       "    0.00585404,\n",
       "    0.014304956,\n",
       "    0.0028993543,\n",
       "    0.011590039,\n",
       "    0.004946608,\n",
       "    -0.023991603,\n",
       "    0.018310934,\n",
       "    0.0056253374,\n",
       "    -0.004297389,\n",
       "    -0.07241746,\n",
       "    -0.003614971,\n",
       "    -0.0046441313,\n",
       "    -0.00061648164,\n",
       "    0.024257192,\n",
       "    -0.017691225,\n",
       "    -0.020406142,\n",
       "    -0.0057950197,\n",
       "    0.0152714085,\n",
       "    0.015035328,\n",
       "    -0.025511367,\n",
       "    -0.010660476,\n",
       "    -0.023135815,\n",
       "    0.010203071,\n",
       "    0.0083218105,\n",
       "    -0.018768338,\n",
       "    -0.01791255,\n",
       "    0.002211403,\n",
       "    -0.020893058,\n",
       "    0.012571246,\n",
       "    -0.023135815,\n",
       "    -0.031752724,\n",
       "    0.03446764,\n",
       "    -0.008107863,\n",
       "    -0.015699303,\n",
       "    0.007694724,\n",
       "    -0.024847392,\n",
       "    0.005721245,\n",
       "    -0.0032479407,\n",
       "    -0.016097687,\n",
       "    -0.038038347,\n",
       "    0.021999681,\n",
       "    -0.03488078,\n",
       "    -0.024109643,\n",
       "    0.009007918,\n",
       "    0.018458484,\n",
       "    0.004400674,\n",
       "    0.0024271947,\n",
       "    0.013722135,\n",
       "    0.017499411,\n",
       "    0.005518364,\n",
       "    0.014954176,\n",
       "    -0.029834578,\n",
       "    -0.021925906,\n",
       "    0.0070344387,\n",
       "    0.0025507677,\n",
       "    -0.020996341,\n",
       "    -0.035234902,\n",
       "    -0.0037920307,\n",
       "    0.02276694,\n",
       "    -0.008196393,\n",
       "    -0.017366616,\n",
       "    -0.012696664,\n",
       "    -0.021365216,\n",
       "    -0.020435652,\n",
       "    -0.01832569,\n",
       "    -0.008343943,\n",
       "    0.012187617,\n",
       "    -0.009575984,\n",
       "    0.017897796,\n",
       "    0.003076414,\n",
       "    0.026440931,\n",
       "    -0.025083473,\n",
       "    0.029259132,\n",
       "    -0.020701243,\n",
       "    0.020391388,\n",
       "    0.007849651,\n",
       "    0.0073221605,\n",
       "    0.0060938084,\n",
       "    -0.011368715,\n",
       "    -0.031369094,\n",
       "    -0.0046441313,\n",
       "    0.023740768,\n",
       "    -0.00057175563,\n",
       "    0.017484656,\n",
       "    0.02120291,\n",
       "    0.024375234,\n",
       "    -0.053058922,\n",
       "    -0.016805926,\n",
       "    0.049871843,\n",
       "    0.0008442617,\n",
       "    0.005429834,\n",
       "    0.003076414,\n",
       "    -0.0284181,\n",
       "    -0.0070086173,\n",
       "    0.030336246,\n",
       "    -0.009184977,\n",
       "    -0.009907971,\n",
       "    -0.0098120645,\n",
       "    -0.0040281108,\n",
       "    0.001503164,\n",
       "    0.004917098,\n",
       "    0.0073258495,\n",
       "    -0.00013371704,\n",
       "    0.014946799,\n",
       "    -0.022058701,\n",
       "    0.026499951,\n",
       "    0.015787832,\n",
       "    0.029214868,\n",
       "    0.032697044,\n",
       "    0.032224886,\n",
       "    -0.005562629,\n",
       "    0.0016092154,\n",
       "    -0.0039211367,\n",
       "    -0.01791255,\n",
       "    -0.012630266,\n",
       "    0.04751105,\n",
       "    0.0155369975,\n",
       "    -0.009598117,\n",
       "    -0.0024788373,\n",
       "    0.011398225,\n",
       "    -0.039277766,\n",
       "    -0.00944319,\n",
       "    -0.015492733,\n",
       "    -0.027459025,\n",
       "    -0.01859128,\n",
       "    0.008956275,\n",
       "    0.010461284,\n",
       "    -0.048337325,\n",
       "    -0.01891589,\n",
       "    0.012740929,\n",
       "    -0.014924666,\n",
       "    0.019476578,\n",
       "    0.0053486815,\n",
       "    0.007274207,\n",
       "    -0.0036186597,\n",
       "    0.004876522,\n",
       "    0.023932584,\n",
       "    0.0016396475,\n",
       "    -0.016289502,\n",
       "    -0.016422296,\n",
       "    -0.0030967023,\n",
       "    0.010682608,\n",
       "    -0.00047538712,\n",
       "    0.21294393,\n",
       "    0.0049724295,\n",
       "    0.03390695,\n",
       "    0.010660476,\n",
       "    0.0032479407,\n",
       "    -0.0041609053,\n",
       "    -0.009376792,\n",
       "    -0.006790981,\n",
       "    0.0047437274,\n",
       "    0.0110514825,\n",
       "    -0.0013620694,\n",
       "    0.005079403,\n",
       "    0.0057101785,\n",
       "    0.00046916236,\n",
       "    -0.008085731,\n",
       "    -0.0072225644,\n",
       "    -0.023489933,\n",
       "    -0.033759404,\n",
       "    -0.0010171717,\n",
       "    0.0013012051,\n",
       "    0.02120291,\n",
       "    -0.016864946,\n",
       "    -0.03579559,\n",
       "    -0.023799788,\n",
       "    0.010483416,\n",
       "    -0.029760802,\n",
       "    -0.013759023,\n",
       "    0.015625527,\n",
       "    0.01847324,\n",
       "    -0.012091709,\n",
       "    -0.011280185,\n",
       "    -0.001310427,\n",
       "    -0.033877444,\n",
       "    0.04571094,\n",
       "    -0.033936463,\n",
       "    -0.0053228606,\n",
       "    0.027650839,\n",
       "    -0.011361337,\n",
       "    0.027075395,\n",
       "    0.0060089673,\n",
       "    0.005488854,\n",
       "    -0.013242598,\n",
       "    0.012593378,\n",
       "    -0.0023571088,\n",
       "    0.010867045,\n",
       "    0.024419498,\n",
       "    ...],\n",
       "   'published': '2021-08-03',\n",
       "   'version': '2.0.0.0'}},\n",
       " {'a': {'person': 'Jing Zhang'},\n",
       "  'p': {'license': 'GPL-3',\n",
       "   'package': 'nomogramFormula',\n",
       "   'md5sum': '552ddb326bbff202be3fe31ec2f36ff3',\n",
       "   'description': '\\n  A nomogram, which can be carried out in rms package, provides a \\n    graphical explanation of a prediction process. However, it is not very easy\\n    to draw straight lines, read points and probabilities accurately. Even, it \\n    is hard for users to calculate total points and probabilities for all \\n    subjects.\\n  This package provides formula_rd() and formula_lp() functions to fit the \\n    formula of total points with raw data and linear predictors respectively by\\n    polynomial regression. Function points_cal() will help you calculate the \\n    total points. prob_cal() can be used to calculate the probabilities after\\n    lrm(), cph() or psm() regression. \\n  For more complex condition, interaction or restricted cubic spine, TotalPoints.rms() \\n    can be used.',\n",
       "   'embedding': [-0.008406254,\n",
       "    0.020939082,\n",
       "    0.0045421477,\n",
       "    0.010440378,\n",
       "    -0.009354054,\n",
       "    0.0078011206,\n",
       "    0.028186105,\n",
       "    0.0013105153,\n",
       "    -0.013750386,\n",
       "    -0.0027303922,\n",
       "    0.008209404,\n",
       "    0.0027832503,\n",
       "    -0.034849867,\n",
       "    0.020647451,\n",
       "    -0.01264948,\n",
       "    0.00111731,\n",
       "    0.027238306,\n",
       "    -0.017716564,\n",
       "    -0.015150214,\n",
       "    0.014807547,\n",
       "    0.022032699,\n",
       "    0.015412682,\n",
       "    0.0015866532,\n",
       "    -0.030154612,\n",
       "    -0.007939645,\n",
       "    0.017045813,\n",
       "    0.03449991,\n",
       "    -0.015995942,\n",
       "    0.0172937,\n",
       "    0.022032699,\n",
       "    0.034674887,\n",
       "    -0.013487919,\n",
       "    -0.015791802,\n",
       "    -0.017643657,\n",
       "    -0.009550905,\n",
       "    0.005121764,\n",
       "    0.013188997,\n",
       "    0.014960654,\n",
       "    -0.009047842,\n",
       "    -0.016331319,\n",
       "    0.022557633,\n",
       "    0.0024843288,\n",
       "    -0.009339472,\n",
       "    0.003393852,\n",
       "    0.0053769406,\n",
       "    -0.01711872,\n",
       "    0.019845467,\n",
       "    -0.04155737,\n",
       "    -0.022076443,\n",
       "    0.009098877,\n",
       "    0.013188997,\n",
       "    -0.0057779327,\n",
       "    -0.019976702,\n",
       "    -0.0066200164,\n",
       "    0.00069945795,\n",
       "    0.012664062,\n",
       "    0.008770793,\n",
       "    -0.004075539,\n",
       "    -0.0060148826,\n",
       "    -0.009485288,\n",
       "    -0.005362359,\n",
       "    -0.0065616905,\n",
       "    -0.037095424,\n",
       "    0.005048856,\n",
       "    0.0019010674,\n",
       "    -0.002642903,\n",
       "    -0.011074675,\n",
       "    0.03301259,\n",
       "    -0.00084390625,\n",
       "    0.031204483,\n",
       "    0.017249955,\n",
       "    0.015193959,\n",
       "    -0.0077136313,\n",
       "    0.010535158,\n",
       "    0.02204728,\n",
       "    -0.0020851593,\n",
       "    -0.053951677,\n",
       "    -0.0018345392,\n",
       "    0.010425797,\n",
       "    0.0057378337,\n",
       "    0.02974633,\n",
       "    0.00083980523,\n",
       "    -0.0022984142,\n",
       "    0.011672518,\n",
       "    -0.006302868,\n",
       "    -0.0068387394,\n",
       "    -0.016783345,\n",
       "    0.04001173,\n",
       "    -0.02965884,\n",
       "    -0.023184638,\n",
       "    0.030562894,\n",
       "    -0.00035451356,\n",
       "    0.009179075,\n",
       "    0.013757677,\n",
       "    -0.014720058,\n",
       "    0.0019028902,\n",
       "    -0.0010781222,\n",
       "    0.040857457,\n",
       "    0.014676314,\n",
       "    -0.033391714,\n",
       "    0.0016859899,\n",
       "    0.032516822,\n",
       "    -0.025809314,\n",
       "    -0.01188395,\n",
       "    -0.039953403,\n",
       "    -0.004133865,\n",
       "    0.015296029,\n",
       "    -0.008158368,\n",
       "    0.0016805218,\n",
       "    0.011184037,\n",
       "    0.000579616,\n",
       "    0.024001205,\n",
       "    -0.0030183776,\n",
       "    -0.00010076068,\n",
       "    0.010505995,\n",
       "    -0.011774588,\n",
       "    0.053543393,\n",
       "    -0.0072470224,\n",
       "    -0.012321396,\n",
       "    0.015893873,\n",
       "    0.0055774366,\n",
       "    0.012839041,\n",
       "    0.019685071,\n",
       "    -0.010323726,\n",
       "    -0.003335526,\n",
       "    0.009499869,\n",
       "    -0.00021382452,\n",
       "    0.0036508515,\n",
       "    -0.03546229,\n",
       "    -0.026028039,\n",
       "    -0.015193959,\n",
       "    0.016418807,\n",
       "    0.0021544215,\n",
       "    0.021230713,\n",
       "    -0.0015183022,\n",
       "    0.051093694,\n",
       "    -0.01558766,\n",
       "    -0.006652825,\n",
       "    -0.045669366,\n",
       "    0.004447368,\n",
       "    0.008967644,\n",
       "    0.017264536,\n",
       "    -0.013174416,\n",
       "    0.009200948,\n",
       "    -0.015281447,\n",
       "    0.01254741,\n",
       "    0.041382395,\n",
       "    0.00798339,\n",
       "    -0.01617092,\n",
       "    -0.04811906,\n",
       "    0.01235785,\n",
       "    -0.00931031,\n",
       "    0.0018883087,\n",
       "    0.0076480145,\n",
       "    -0.0019356987,\n",
       "    0.0038276527,\n",
       "    0.018022776,\n",
       "    0.036862116,\n",
       "    -0.021318203,\n",
       "    0.011468376,\n",
       "    -0.022018116,\n",
       "    0.02347627,\n",
       "    -0.007917773,\n",
       "    0.0055665006,\n",
       "    0.0001624474,\n",
       "    0.023345036,\n",
       "    0.009448834,\n",
       "    -0.018853923,\n",
       "    -0.004837424,\n",
       "    0.021332784,\n",
       "    -0.013816004,\n",
       "    0.01710414,\n",
       "    -0.04342381,\n",
       "    0.013458756,\n",
       "    0.009857117,\n",
       "    0.013371266,\n",
       "    -0.014494045,\n",
       "    -0.017993612,\n",
       "    -0.02831734,\n",
       "    -0.022557633,\n",
       "    0.01340772,\n",
       "    0.019947538,\n",
       "    0.01264948,\n",
       "    0.022951335,\n",
       "    0.0058690673,\n",
       "    -0.01426074,\n",
       "    0.0218723,\n",
       "    -0.024001205,\n",
       "    0.005045211,\n",
       "    0.015952198,\n",
       "    0.021084897,\n",
       "    0.019058065,\n",
       "    -0.0038385887,\n",
       "    -0.015762638,\n",
       "    -0.54733247,\n",
       "    -0.032283515,\n",
       "    -0.015296029,\n",
       "    -0.009171785,\n",
       "    0.021974372,\n",
       "    -0.015354355,\n",
       "    0.018226918,\n",
       "    0.0058326134,\n",
       "    -0.024496976,\n",
       "    0.051181182,\n",
       "    -0.036570486,\n",
       "    0.005493593,\n",
       "    0.01881018,\n",
       "    -0.045756854,\n",
       "    -0.012605736,\n",
       "    -0.024949005,\n",
       "    0.0038385887,\n",
       "    0.005675862,\n",
       "    -0.029979633,\n",
       "    0.0074876174,\n",
       "    -0.027325794,\n",
       "    0.0013178061,\n",
       "    -0.01786238,\n",
       "    0.010571612,\n",
       "    0.0012066219,\n",
       "    0.023651248,\n",
       "    0.025503103,\n",
       "    0.0011391824,\n",
       "    0.000530859,\n",
       "    0.0063940026,\n",
       "    -0.031875234,\n",
       "    0.011862078,\n",
       "    5.5136425e-05,\n",
       "    -0.014421137,\n",
       "    0.038553577,\n",
       "    -0.013633735,\n",
       "    -0.033595853,\n",
       "    0.028681878,\n",
       "    0.03543313,\n",
       "    0.023622084,\n",
       "    -0.047098354,\n",
       "    -0.014413847,\n",
       "    0.030883688,\n",
       "    0.014100343,\n",
       "    -0.0075532347,\n",
       "    -0.009594649,\n",
       "    0.0013269195,\n",
       "    0.016331319,\n",
       "    0.0037219366,\n",
       "    -0.03175858,\n",
       "    0.0036617876,\n",
       "    0.0032954267,\n",
       "    -0.008151078,\n",
       "    -0.00717776,\n",
       "    0.034733213,\n",
       "    -0.017804053,\n",
       "    0.012882785,\n",
       "    -0.057801202,\n",
       "    -0.013240033,\n",
       "    -0.02309715,\n",
       "    -0.017979031,\n",
       "    -0.035228986,\n",
       "    -0.014916909,\n",
       "    -0.019378858,\n",
       "    0.0055628554,\n",
       "    0.0023439815,\n",
       "    -0.003032959,\n",
       "    -0.007443873,\n",
       "    0.00045066053,\n",
       "    -0.0049941754,\n",
       "    0.0007609738,\n",
       "    0.021945208,\n",
       "    0.01606885,\n",
       "    0.010564322,\n",
       "    0.006977264,\n",
       "    0.009157203,\n",
       "    0.03452907,\n",
       "    -0.0050014663,\n",
       "    -0.00025403767,\n",
       "    0.01834357,\n",
       "    0.019451765,\n",
       "    0.0033482846,\n",
       "    0.0068168673,\n",
       "    -0.019699652,\n",
       "    0.00049805053,\n",
       "    -0.009157203,\n",
       "    0.025226053,\n",
       "    0.0030602994,\n",
       "    -0.026873767,\n",
       "    0.025459358,\n",
       "    0.018197754,\n",
       "    -0.0052056075,\n",
       "    0.023170058,\n",
       "    -0.03412079,\n",
       "    -0.0045093396,\n",
       "    0.0056211813,\n",
       "    -0.018751852,\n",
       "    -0.016127177,\n",
       "    -0.0118183335,\n",
       "    -0.025546847,\n",
       "    -0.00018500321,\n",
       "    -0.0014034726,\n",
       "    0.015135632,\n",
       "    0.028171524,\n",
       "    0.010571612,\n",
       "    0.020559963,\n",
       "    -0.00073819014,\n",
       "    0.009368636,\n",
       "    0.020035028,\n",
       "    -0.03108783,\n",
       "    -0.010790335,\n",
       "    -0.031875234,\n",
       "    -0.0067731226,\n",
       "    0.0036289792,\n",
       "    0.0205308,\n",
       "    -0.04097411,\n",
       "    0.029177649,\n",
       "    -0.008668722,\n",
       "    -0.0083479285,\n",
       "    -0.0020869821,\n",
       "    0.014610697,\n",
       "    0.0031295617,\n",
       "    0.0053186147,\n",
       "    -0.00689342,\n",
       "    0.0017525181,\n",
       "    0.0054024584,\n",
       "    0.02185772,\n",
       "    -0.0024114212,\n",
       "    -0.00013499311,\n",
       "    -0.02177023,\n",
       "    -0.017979031,\n",
       "    -0.010396633,\n",
       "    0.011184037,\n",
       "    -0.0307962,\n",
       "    0.009915443,\n",
       "    0.01568973,\n",
       "    0.019553836,\n",
       "    -0.009536323,\n",
       "    -0.01340043,\n",
       "    -0.020457892,\n",
       "    -0.008049007,\n",
       "    -0.0033482846,\n",
       "    0.021682741,\n",
       "    -0.025809314,\n",
       "    -0.014654442,\n",
       "    -0.054068327,\n",
       "    -0.016375063,\n",
       "    0.01055703,\n",
       "    0.029163068,\n",
       "    0.004505694,\n",
       "    -0.02927972,\n",
       "    -0.013823294,\n",
       "    -0.011300689,\n",
       "    0.01188395,\n",
       "    -0.007385547,\n",
       "    -0.015033562,\n",
       "    -0.021157805,\n",
       "    -0.01881018,\n",
       "    -0.0039005603,\n",
       "    -0.010316435,\n",
       "    -0.0022747193,\n",
       "    0.02681544,\n",
       "    -0.008902026,\n",
       "    -0.00354149,\n",
       "    -0.0020906273,\n",
       "    -0.031321134,\n",
       "    -0.029775493,\n",
       "    0.034849867,\n",
       "    -0.006722087,\n",
       "    -0.038728554,\n",
       "    -0.020545382,\n",
       "    0.011431922,\n",
       "    -0.008114624,\n",
       "    0.010841371,\n",
       "    -0.02109948,\n",
       "    0.03694961,\n",
       "    0.005668571,\n",
       "    -0.011621483,\n",
       "    -0.021551507,\n",
       "    -0.02500733,\n",
       "    0.01340772,\n",
       "    -0.0017388479,\n",
       "    -0.035228986,\n",
       "    0.00036294348,\n",
       "    0.027413284,\n",
       "    0.008953062,\n",
       "    0.031321134,\n",
       "    -0.0036581424,\n",
       "    -0.024919841,\n",
       "    0.016506296,\n",
       "    -0.027704915,\n",
       "    0.04342381,\n",
       "    -0.018941412,\n",
       "    0.017658237,\n",
       "    0.022965916,\n",
       "    0.014785675,\n",
       "    -0.0043781055,\n",
       "    0.010637229,\n",
       "    -0.0030110867,\n",
       "    0.028740203,\n",
       "    0.0062044426,\n",
       "    0.0186352,\n",
       "    0.009485288,\n",
       "    0.0010635406,\n",
       "    0.020282913,\n",
       "    -0.011606901,\n",
       "    0.01550017,\n",
       "    -0.019976702,\n",
       "    0.015514752,\n",
       "    -0.0012722388,\n",
       "    -0.025590591,\n",
       "    -0.017949868,\n",
       "    -0.04289887,\n",
       "    -0.03175858,\n",
       "    -0.009674848,\n",
       "    0.007691759,\n",
       "    0.009186367,\n",
       "    0.004819197,\n",
       "    -0.006685633,\n",
       "    0.0033446394,\n",
       "    -0.00017907946,\n",
       "    -0.018649781,\n",
       "    0.048993953,\n",
       "    -0.008799955,\n",
       "    0.027252886,\n",
       "    0.024438651,\n",
       "    0.0026574845,\n",
       "    0.01606885,\n",
       "    0.00096784934,\n",
       "    -0.012970274,\n",
       "    -0.005522756,\n",
       "    0.015616823,\n",
       "    0.0045931833,\n",
       "    0.0015884759,\n",
       "    0.021507762,\n",
       "    -0.02681544,\n",
       "    0.019801723,\n",
       "    -0.009470706,\n",
       "    0.031962723,\n",
       "    0.0012385191,\n",
       "    -0.027806984,\n",
       "    -0.0039005603,\n",
       "    0.03546229,\n",
       "    -0.0154272625,\n",
       "    -0.019087227,\n",
       "    -0.0313503,\n",
       "    0.01520854,\n",
       "    0.018547712,\n",
       "    0.020837013,\n",
       "    -0.0034321286,\n",
       "    -0.03490819,\n",
       "    0.044036232,\n",
       "    -0.014887746,\n",
       "    0.012328687,\n",
       "    0.02232433,\n",
       "    -0.010527868,\n",
       "    0.0058800033,\n",
       "    0.028011126,\n",
       "    0.03925349,\n",
       "    0.053689208,\n",
       "    0.0026757114,\n",
       "    0.01636048,\n",
       "    -0.006084145,\n",
       "    -0.01045496,\n",
       "    0.01615634,\n",
       "    -0.029338047,\n",
       "    -0.0061169537,\n",
       "    -0.043977905,\n",
       "    -0.0070027816,\n",
       "    -0.006095081,\n",
       "    -0.010491414,\n",
       "    -0.0016267524,\n",
       "    -0.017483259,\n",
       "    -0.0044327863,\n",
       "    -0.01054974,\n",
       "    -0.016695857,\n",
       "    0.004305198,\n",
       "    0.017789472,\n",
       "    0.014472173,\n",
       "    -0.0012886431,\n",
       "    -0.01901432,\n",
       "    -0.016112596,\n",
       "    0.025984293,\n",
       "    0.012481793,\n",
       "    -0.0057998053,\n",
       "    0.006977264,\n",
       "    -0.008996806,\n",
       "    -0.01786238,\n",
       "    -0.01881018,\n",
       "    -0.0094634155,\n",
       "    0.038961858,\n",
       "    0.017906124,\n",
       "    0.00998106,\n",
       "    0.02871104,\n",
       "    -0.030883688,\n",
       "    -0.0069954908,\n",
       "    0.011738135,\n",
       "    0.001836362,\n",
       "    -0.013794131,\n",
       "    -0.0021507763,\n",
       "    -0.003991695,\n",
       "    -0.0027595554,\n",
       "    -0.01959758,\n",
       "    -0.02263054,\n",
       "    0.021974372,\n",
       "    0.015981361,\n",
       "    -0.013210869,\n",
       "    -0.0094634155,\n",
       "    0.0023129957,\n",
       "    0.03563727,\n",
       "    0.010637229,\n",
       "    -0.014005563,\n",
       "    -0.006244542,\n",
       "    -0.015893873,\n",
       "    0.01586471,\n",
       "    -0.017352026,\n",
       "    -9.591915e-05,\n",
       "    -0.013444174,\n",
       "    0.017833216,\n",
       "    0.011344434,\n",
       "    -0.013240033,\n",
       "    -0.027821567,\n",
       "    -0.019247625,\n",
       "    0.022251422,\n",
       "    0.0005923748,\n",
       "    0.052201893,\n",
       "    0.019174717,\n",
       "    0.015558497,\n",
       "    -0.017133303,\n",
       "    -0.0029582286,\n",
       "    -0.021916045,\n",
       "    -0.02831734,\n",
       "    0.032166865,\n",
       "    0.028098617,\n",
       "    -0.00266113,\n",
       "    -0.00027066973,\n",
       "    -0.02109948,\n",
       "    -0.012518247,\n",
       "    0.006510655,\n",
       "    -0.02006419,\n",
       "    0.007345448,\n",
       "    -0.0228201,\n",
       "    0.0032844904,\n",
       "    0.022790937,\n",
       "    -0.018489385,\n",
       "    -0.010294563,\n",
       "    0.03301259,\n",
       "    -0.0064231656,\n",
       "    0.010564322,\n",
       "    -0.005934684,\n",
       "    0.009667557,\n",
       "    0.008238567,\n",
       "    -0.024978168,\n",
       "    -0.007837575,\n",
       "    -0.023228383,\n",
       "    0.027777823,\n",
       "    -0.0135025,\n",
       "    0.0061716344,\n",
       "    -0.02177023,\n",
       "    0.0052602882,\n",
       "    0.03604555,\n",
       "    0.0031860652,\n",
       "    0.0021945208,\n",
       "    -0.00903326,\n",
       "    0.0062591233,\n",
       "    0.02158067,\n",
       "    0.006273705,\n",
       "    0.0011264235,\n",
       "    0.017512422,\n",
       "    0.022601377,\n",
       "    -0.0072324406,\n",
       "    -0.005599309,\n",
       "    0.032808453,\n",
       "    -0.0021033862,\n",
       "    0.0032061148,\n",
       "    -0.0119568575,\n",
       "    0.007815702,\n",
       "    -0.010768463,\n",
       "    0.018022776,\n",
       "    0.008318765,\n",
       "    -0.0030493634,\n",
       "    -0.029513024,\n",
       "    -0.0047098356,\n",
       "    -0.042811383,\n",
       "    -0.032662638,\n",
       "    -0.017220791,\n",
       "    0.035666432,\n",
       "    -0.02235349,\n",
       "    -0.02585306,\n",
       "    0.015748058,\n",
       "    -0.042373937,\n",
       "    0.0036198657,\n",
       "    -0.03441242,\n",
       "    0.011687099,\n",
       "    0.0010772108,\n",
       "    -0.02709249,\n",
       "    -0.010950732,\n",
       "    0.024788607,\n",
       "    -0.0049941754,\n",
       "    0.005063438,\n",
       "    0.005289451,\n",
       "    0.001283175,\n",
       "    0.002418712,\n",
       "    0.009237402,\n",
       "    0.0074110646,\n",
       "    -0.028171524,\n",
       "    -0.012139127,\n",
       "    -0.04896479,\n",
       "    -0.004079184,\n",
       "    0.0029144841,\n",
       "    0.008209404,\n",
       "    -0.0017005714,\n",
       "    -0.015660567,\n",
       "    0.006503364,\n",
       "    -0.008573942,\n",
       "    0.026203016,\n",
       "    0.01662295,\n",
       "    -0.024671955,\n",
       "    0.002128904,\n",
       "    -0.003944305,\n",
       "    0.001820869,\n",
       "    0.032254353,\n",
       "    0.0060877902,\n",
       "    -0.020457892,\n",
       "    0.008340637,\n",
       "    -0.03983675,\n",
       "    -0.00689342,\n",
       "    -0.02699042,\n",
       "    0.007720922,\n",
       "    0.008151078,\n",
       "    0.002400485,\n",
       "    -0.009878989,\n",
       "    -0.028273594,\n",
       "    -0.026086364,\n",
       "    0.003849525,\n",
       "    -0.009426962,\n",
       "    0.0031186256,\n",
       "    0.013451465,\n",
       "    0.03070871,\n",
       "    0.007148597,\n",
       "    0.008676013,\n",
       "    0.022965916,\n",
       "    0.02595513,\n",
       "    -0.018693527,\n",
       "    -0.008231276,\n",
       "    0.0034904548,\n",
       "    0.021274459,\n",
       "    0.0031915333,\n",
       "    -0.020005865,\n",
       "    0.028886018,\n",
       "    -0.02414702,\n",
       "    0.004250517,\n",
       "    -0.033508364,\n",
       "    0.009426962,\n",
       "    0.029440116,\n",
       "    0.0007072044,\n",
       "    -0.0020468829,\n",
       "    -0.024015786,\n",
       "    0.0011829269,\n",
       "    -0.019685071,\n",
       "    -0.008595814,\n",
       "    -0.009995641,\n",
       "    0.009492579,\n",
       "    0.0021926982,\n",
       "    0.021682741,\n",
       "    0.011205909,\n",
       "    0.007764667,\n",
       "    0.0033974973,\n",
       "    0.025678081,\n",
       "    -0.018226918,\n",
       "    -0.0025226055,\n",
       "    0.0041812547,\n",
       "    -0.007137661,\n",
       "    -0.001111842,\n",
       "    0.020953665,\n",
       "    -0.006284641,\n",
       "    -0.029192232,\n",
       "    -0.014195124,\n",
       "    -0.0021070316,\n",
       "    -0.010498704,\n",
       "    0.0017479614,\n",
       "    0.008413545,\n",
       "    0.01939344,\n",
       "    0.0067658317,\n",
       "    0.04960638,\n",
       "    0.007378256,\n",
       "    -0.01016333,\n",
       "    0.0035797665,\n",
       "    0.0176874,\n",
       "    0.027923638,\n",
       "    0.00087762607,\n",
       "    0.0012248488,\n",
       "    -0.04610681,\n",
       "    -0.0021489535,\n",
       "    0.013998273,\n",
       "    0.016010525,\n",
       "    -0.013145253,\n",
       "    -0.025794733,\n",
       "    0.02681544,\n",
       "    0.013546245,\n",
       "    0.005705025,\n",
       "    -0.018008195,\n",
       "    0.008668722,\n",
       "    -0.056809656,\n",
       "    -0.019495511,\n",
       "    0.0047207717,\n",
       "    -0.025138564,\n",
       "    0.014391974,\n",
       "    -0.040274195,\n",
       "    -0.003548781,\n",
       "    -0.032283515,\n",
       "    -0.0031824198,\n",
       "    0.009667557,\n",
       "    0.0054425574,\n",
       "    0.0017160643,\n",
       "    -0.012824459,\n",
       "    0.029031834,\n",
       "    -0.001572983,\n",
       "    0.029804654,\n",
       "    0.025780153,\n",
       "    -0.008092752,\n",
       "    -0.03382916,\n",
       "    0.0013314763,\n",
       "    0.0120370565,\n",
       "    -0.021376528,\n",
       "    0.049373075,\n",
       "    0.01340772,\n",
       "    -0.004454659,\n",
       "    -0.002300237,\n",
       "    -0.031291973,\n",
       "    -0.028886018,\n",
       "    -0.025357287,\n",
       "    0.03449991,\n",
       "    -0.010323726,\n",
       "    -0.0026337896,\n",
       "    -0.0018163123,\n",
       "    -0.004050021,\n",
       "    0.007385547,\n",
       "    0.01662295,\n",
       "    0.025940549,\n",
       "    0.00570138,\n",
       "    0.0013970932,\n",
       "    -0.043861255,\n",
       "    -0.021259876,\n",
       "    0.022134768,\n",
       "    -0.044240374,\n",
       "    0.026552973,\n",
       "    0.011555865,\n",
       "    0.004494758,\n",
       "    0.027821567,\n",
       "    -0.009835244,\n",
       "    -0.006558045,\n",
       "    0.020107936,\n",
       "    -0.001886486,\n",
       "    0.0047973245,\n",
       "    0.02614469,\n",
       "    0.02785073,\n",
       "    0.0018062876,\n",
       "    -0.01739577,\n",
       "    0.00061880384,\n",
       "    -0.005770642,\n",
       "    -0.021813974,\n",
       "    -0.017468678,\n",
       "    0.0068423846,\n",
       "    0.02034124,\n",
       "    0.011811042,\n",
       "    -0.0045494386,\n",
       "    0.013108799,\n",
       "    -0.05599309,\n",
       "    0.018110266,\n",
       "    -0.020982828,\n",
       "    -0.0046332823,\n",
       "    -0.02004961,\n",
       "    0.00078193477,\n",
       "    -0.009776918,\n",
       "    0.037678685,\n",
       "    0.0027704914,\n",
       "    -0.00063019566,\n",
       "    0.004494758,\n",
       "    -0.0075823977,\n",
       "    0.0010845016,\n",
       "    -0.027048746,\n",
       "    -0.011519412,\n",
       "    0.026975838,\n",
       "    0.022499306,\n",
       "    0.046398442,\n",
       "    0.007112143,\n",
       "    -0.022382654,\n",
       "    0.024176184,\n",
       "    -0.005468075,\n",
       "    0.022601377,\n",
       "    0.0076553053,\n",
       "    -0.028433992,\n",
       "    0.039690934,\n",
       "    -0.016870834,\n",
       "    0.0043781055,\n",
       "    -0.0047790976,\n",
       "    -0.012029765,\n",
       "    -0.00019480017,\n",
       "    0.003736518,\n",
       "    -0.0120370565,\n",
       "    0.023155475,\n",
       "    -0.025721826,\n",
       "    -0.0035815893,\n",
       "    0.03184607,\n",
       "    -0.012532828,\n",
       "    -0.044911124,\n",
       "    -0.00058280566,\n",
       "    -0.017658237,\n",
       "    0.019757979,\n",
       "    -0.029104741,\n",
       "    -3.9045473e-05,\n",
       "    -0.035899736,\n",
       "    -0.027836148,\n",
       "    -0.034849867,\n",
       "    -0.0029873918,\n",
       "    -0.012044347,\n",
       "    0.027602844,\n",
       "    -0.004436432,\n",
       "    -0.0003916509,\n",
       "    0.012212034,\n",
       "    0.02881311,\n",
       "    -0.03601639,\n",
       "    0.034995683,\n",
       "    0.007349093,\n",
       "    0.0042833257,\n",
       "    -0.035578944,\n",
       "    0.0037875534,\n",
       "    -0.028463155,\n",
       "    -0.031029504,\n",
       "    0.012299524,\n",
       "    -0.01568973,\n",
       "    -0.05380586,\n",
       "    -0.026786277,\n",
       "    0.01730828,\n",
       "    0.0039370144,\n",
       "    0.009171785,\n",
       "    -0.022922171,\n",
       "    0.0028889664,\n",
       "    0.042723894,\n",
       "    0.012919239,\n",
       "    -0.02423451,\n",
       "    -0.007895901,\n",
       "    0.011614191,\n",
       "    0.03307092,\n",
       "    0.0114392135,\n",
       "    -0.0015711603,\n",
       "    -0.011519412,\n",
       "    0.05762622,\n",
       "    -0.04173235,\n",
       "    0.0011127533,\n",
       "    0.015835546,\n",
       "    -0.034383256,\n",
       "    -0.014005563,\n",
       "    0.012379723,\n",
       "    0.030737873,\n",
       "    -0.032166865,\n",
       "    0.00080061733,\n",
       "    -0.02159525,\n",
       "    -0.0136118615,\n",
       "    -0.010586194,\n",
       "    0.036278855,\n",
       "    0.0054498482,\n",
       "    -0.008311475,\n",
       "    0.030825363,\n",
       "    0.009208239,\n",
       "    -0.027792403,\n",
       "    0.004498403,\n",
       "    -0.038961858,\n",
       "    -0.040449176,\n",
       "    0.02035582,\n",
       "    0.0014317244,\n",
       "    -0.004924913,\n",
       "    -0.0260572,\n",
       "    0.0053915223,\n",
       "    0.042957198,\n",
       "    0.05112286,\n",
       "    -0.034470744,\n",
       "    -0.01606885,\n",
       "    -0.0053368416,\n",
       "    -0.039282653,\n",
       "    -0.0067366688,\n",
       "    -0.030825363,\n",
       "    0.003536022,\n",
       "    0.010637229,\n",
       "    0.036220532,\n",
       "    -0.0023257546,\n",
       "    0.017527003,\n",
       "    -0.009631103,\n",
       "    0.018081103,\n",
       "    -0.021274459,\n",
       "    0.0018755498,\n",
       "    0.0037146457,\n",
       "    -0.0017771245,\n",
       "    0.034441583,\n",
       "    -0.002442407,\n",
       "    -0.0056029544,\n",
       "    0.0012321396,\n",
       "    0.011300689,\n",
       "    0.02650923,\n",
       "    0.005551919,\n",
       "    -0.0078011206,\n",
       "    -0.0063466127,\n",
       "    -0.043773767,\n",
       "    -0.006455974,\n",
       "    0.022893008,\n",
       "    0.021274459,\n",
       "    -0.00470619,\n",
       "    0.013159835,\n",
       "    -0.0051691537,\n",
       "    -0.0015183022,\n",
       "    0.0058216774,\n",
       "    0.010250818,\n",
       "    -0.014501335,\n",
       "    -0.024569884,\n",
       "    0.006787704,\n",
       "    -0.018853923,\n",
       "    -0.013560827,\n",
       "    -0.0010608066,\n",
       "    -0.015325192,\n",
       "    0.01207351,\n",
       "    0.003251682,\n",
       "    0.034295768,\n",
       "    -0.010710137,\n",
       "    -0.003512327,\n",
       "    0.037766173,\n",
       "    -0.0034795185,\n",
       "    0.011133001,\n",
       "    -0.024949005,\n",
       "    -0.007195987,\n",
       "    -0.027252886,\n",
       "    -0.04922726,\n",
       "    0.03639551,\n",
       "    -0.008697885,\n",
       "    -0.0017406706,\n",
       "    0.015762638,\n",
       "    0.03601639,\n",
       "    0.012613026,\n",
       "    -0.024394907,\n",
       "    0.009930025,\n",
       "    -0.028156942,\n",
       "    -0.02879853,\n",
       "    0.022455562,\n",
       "    0.009594649,\n",
       "    -0.029250557,\n",
       "    0.017497841,\n",
       "    -0.016375063,\n",
       "    -0.002974633,\n",
       "    0.012875495,\n",
       "    -0.017352026,\n",
       "    0.0065799174,\n",
       "    -0.010761172,\n",
       "    -0.0025353641,\n",
       "    -0.0049394947,\n",
       "    -0.0049650124,\n",
       "    -0.020647451,\n",
       "    0.01264948,\n",
       "    -0.024132438,\n",
       "    -0.008435417,\n",
       "    0.036249693,\n",
       "    0.17871128,\n",
       "    0.008544778,\n",
       "    -0.007473036,\n",
       "    -0.0032334551,\n",
       "    0.010207074,\n",
       "    0.012124546,\n",
       "    -0.0025681728,\n",
       "    0.0067949947,\n",
       "    0.009419671,\n",
       "    0.0070465263,\n",
       "    0.016870834,\n",
       "    0.009827954,\n",
       "    -0.016331319,\n",
       "    0.009529033,\n",
       "    0.010863243,\n",
       "    -0.0074876174,\n",
       "    -0.022280583,\n",
       "    -0.03353753,\n",
       "    -0.029119324,\n",
       "    -0.01454508,\n",
       "    0.022747193,\n",
       "    -0.004582247,\n",
       "    -0.004305198,\n",
       "    -0.01691458,\n",
       "    -0.0055737915,\n",
       "    -0.0045749564,\n",
       "    -0.02101199,\n",
       "    -0.009397798,\n",
       "    0.014238868,\n",
       "    0.00011756361,\n",
       "    -0.00883641,\n",
       "    -0.013517082,\n",
       "    -0.012583864,\n",
       "    0.011475667,\n",
       "    -0.023680411,\n",
       "    -0.0033045402,\n",
       "    0.010090422,\n",
       "    -0.010943442,\n",
       "    0.014479463,\n",
       "    0.0058289682,\n",
       "    0.0027085198,\n",
       "    -0.028871438,\n",
       "    -0.0046624453,\n",
       "    -0.029819237,\n",
       "    -0.020370403,\n",
       "    -0.0099227335,\n",
       "    ...],\n",
       "   'published': '2020-01-28',\n",
       "   'version': '1.2.0.0'}}]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Testing the connection to neo4j\n",
    "test_query = \"\"\"\n",
    "MATCH (a:Person {person: 'Jing Zhang'})-[:MAINTAINS]->(p:Package)\n",
    "RETURN a,p\n",
    "LIMIT 10;\n",
    "\"\"\"\n",
    "\n",
    "package_maintainer = connection.query(db=\"cran\", query=test_query).data()\n",
    "package_maintainer"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Create constraint on the various nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Creating the constraints with: CREATE CONSTRAINT IF NOT EXISTS FOR (d:Dependency) REQUIRE d.name IS UNIQUE\n",
      "Creating the constraints with: CREATE CONSTRAINT IF NOT EXISTS FOR (o:Organization) REQUIRE o.name IS UNIQUE\n",
      "Creating the constraints with: CREATE CONSTRAINT IF NOT EXISTS FOR (l:License) REQUIRE l.type IS UNIQUE\n",
      "Creating the constraints with: CREATE CONSTRAINT IF NOT EXISTS FOR (i:Institution) REQUIRE i.type IS UNIQUE\n",
      "Creating the constraints with: CREATE CONSTRAINT IF NOT EXISTS FOR (a:Person) REQUIRE a.name IS UNIQUE\n",
      "Creating the constraints with: CREATE CONSTRAINT IF NOT EXISTS FOR (p:Package) REQUIRE p.name IS UNIQUE\n"
     ]
    }
   ],
   "source": [
    "# Create a constraint on 'Package' nodes based on the 'package' property\n",
    "constraint_package_query = \"CREATE CONSTRAINT IF NOT EXISTS FOR (p:Package) REQUIRE p.name IS UNIQUE\"\n",
    "\n",
    "# Create a constraint on 'Person' nodes based on the 'person' property\n",
    "constraint_person_query = \"CREATE CONSTRAINT IF NOT EXISTS FOR (a:Person) REQUIRE a.name IS UNIQUE\"\n",
    "\n",
    "# Create a constraint on 'Person' nodes based on the 'person' property\n",
    "constraint_license_query = \"CREATE CONSTRAINT IF NOT EXISTS FOR (l:License) REQUIRE l.type IS UNIQUE\"\n",
    "\n",
    "# # Create a constraint on 'Person' nodes based on the 'person' property\n",
    "# constraint_license_query = \"CREATE CONSTRAINT IF NOT EXISTS FOR (l:License) REQUIRE l.license IS UNIQUE\"\n",
    "\n",
    "# Create a constraint on 'Person' nodes based on the 'person' property\n",
    "constraint_institution_query = \"CREATE CONSTRAINT IF NOT EXISTS FOR (i:Institution) REQUIRE i.type IS UNIQUE\"\n",
    "\n",
    "# Create a constraint on 'Person' nodes based on the 'person' property\n",
    "constraint_organization_query = \"CREATE CONSTRAINT IF NOT EXISTS FOR (o:Organization) REQUIRE o.name IS UNIQUE\"\n",
    "\n",
    "# Create a constraint on 'Person' nodes based on the 'person' property\n",
    "constraint_dependency_query = \"CREATE CONSTRAINT IF NOT EXISTS FOR (d:Dependency) REQUIRE d.name IS UNIQUE\"\n",
    "\n",
    "# Create an index on the 'person' property of 'Person' nodes\n",
    "person_index_query = \"CREATE INDEX ON :Person(person)\"\n",
    "\n",
    "constraints = [constraint_dependency_query, constraint_organization_query, constraint_license_query, constraint_institution_query, constraint_person_query, constraint_package_query]\n",
    "\n",
    "# for constraint in constraints:\n",
    "#     print(f\"Creating the constraints with: {constraint}\")\n",
    "#     connection.query(constraint)\n",
    "# connection.close()\n",
    "\n",
    "\n",
    "#db_session = establish_connection()\n",
    "\n",
    "for constraint in constraints:\n",
    "    print(f\"Creating the constraints with: {constraint}\")\n",
    "    connection.query(db=\"neo4j\", query=constraint)\n",
    "#db_session.close()\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# ## Loading package nodes from csv file\n",
    "# load_package_query = \"\"\"\n",
    "# // Load 'Package' nodes from the CSV file\n",
    "# LOAD CSV WITH HEADERS FROM 'file:///cran_data.csv' AS row\n",
    "# CALL {\n",
    "#     WITH row\n",
    "#     MERGE (p:Package {\n",
    "#         name: row.package,\n",
    "#         version: row.version,\n",
    "#         license: row.license,\n",
    "#         md5sum: row.md5sum,\n",
    "#         description: row.description,\n",
    "#         latestPublishedDate: row.published_date\n",
    "#     })\n",
    "#     ON CREATE SET\n",
    "#         p.name = row.package,\n",
    "#         p.version = row.version,\n",
    "#         p.license = row.license,\n",
    "#         p.md5sum = row.md5sum,\n",
    "#         p.description = row.description,\n",
    "#         p.latestPublishedDate = row.published_date\n",
    "#     ON MATCH SET\n",
    "#         p.name = row.package,\n",
    "#         p.version = row.version,\n",
    "#         p.license = row.license,\n",
    "#         p.md5sum = row.md5sum,\n",
    "#         p.description = row.description,\n",
    "#         p.latestPublishedDate = row.published_date\n",
    "# } IN TRANSACTIONS OF 10000 ROWS;\n",
    "# \"\"\"\n",
    "# print(f\"loading query....\")\n",
    "# connection.query(db=\"neo4j\", query=load_package_query)\n",
    "# connection.close()\n",
    "# print(f\"end operation....\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "loading query....\n",
      "end operation....\n"
     ]
    }
   ],
   "source": [
    "## THis fix the issue\n",
    "## Loading package nodes from csv file\n",
    "load_package_query = \"\"\"\n",
    "// Load 'Package' nodes from the CSV file\n",
    "LOAD CSV WITH HEADERS FROM 'file:///cran_df.csv' AS row\n",
    "CALL {\n",
    "    WITH row\n",
    "    MERGE (p:Package {name: row.package})\n",
    "    ON CREATE SET\n",
    "        p.version = row.version,\n",
    "        p.license = row.license,\n",
    "        p.md5sum = row.md5sum,\n",
    "        p.description = row.description,\n",
    "        p.latestPublishedDate = row.published_date\n",
    "    ON MATCH SET\n",
    "        p.version = row.version,\n",
    "        p.license = row.license,\n",
    "        p.md5sum = row.md5sum,\n",
    "        p.description = row.description,\n",
    "        p.latestPublishedDate = row.published_date\n",
    "} IN TRANSACTIONS OF 10000 ROWS;\n",
    "\"\"\"\n",
    "print(f\"loading query....\")\n",
    "connection.query(db=\"neo4j\", query=load_package_query)\n",
    "connection.close()\n",
    "print(f\"end operation....\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "loading query....\n"
     ]
    },
    {
     "ename": "CypherSyntaxError",
     "evalue": "{code: Neo.ClientError.Statement.SyntaxError} {message: Invalid input 'latestPublishedDate': expected\r\n  \"!=\"\r\n  \"%\"\r\n  \"*\"\r\n  \"+\"\r\n  \",\"\r\n  \"-\"\r\n  \"/\"\r\n  \"::\"\r\n  \"<\"\r\n  \"<=\"\r\n  \"<>\"\r\n  \"=\"\r\n  \"=~\"\r\n  \">\"\r\n  \">=\"\r\n  \"AND\"\r\n  \"CALL\"\r\n  \"CONTAINS\"\r\n  \"CREATE\"\r\n  \"DELETE\"\r\n  \"DETACH\"\r\n  \"ENDS\"\r\n  \"FOREACH\"\r\n  \"IN\"\r\n  \"IS\"\r\n  \"LOAD\"\r\n  \"MATCH\"\r\n  \"MERGE\"\r\n  \"ON\"\r\n  \"OPTIONAL\"\r\n  \"OR\"\r\n  \"REMOVE\"\r\n  \"RETURN\"\r\n  \"SET\"\r\n  \"STARTS\"\r\n  \"UNION\"\r\n  \"UNWIND\"\r\n  \"USE\"\r\n  \"WITH\"\r\n  \"XOR\"\r\n  \"^\"\r\n  \"}\" (line 20, column 9 (offset: 533))\r\n\"        latestPublishedDate = row.published_date\"\r\n         ^}",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mCypherSyntaxError\u001b[0m                         Traceback (most recent call last)",
      "\u001b[1;32mc:\\Users\\Dee\\root\\Projects\\dev\\cran2graph\\scripts\\02_Loading_Data_Neo4j.ipynb Cell 9\u001b[0m line \u001b[0;36m3\n\u001b[0;32m      <a href='vscode-notebook-cell:/c%3A/Users/Dee/root/Projects/dev/cran2graph/scripts/02_Loading_Data_Neo4j.ipynb#X11sZmlsZQ%3D%3D?line=1'>2</a>\u001b[0m load_package_query \u001b[39m=\u001b[39m \u001b[39m\"\"\"\u001b[39m\n\u001b[0;32m      <a href='vscode-notebook-cell:/c%3A/Users/Dee/root/Projects/dev/cran2graph/scripts/02_Loading_Data_Neo4j.ipynb#X11sZmlsZQ%3D%3D?line=2'>3</a>\u001b[0m \u001b[39m// Load \u001b[39m\u001b[39m'\u001b[39m\u001b[39mPackage\u001b[39m\u001b[39m'\u001b[39m\u001b[39m nodes from the CSV file\u001b[39m\n\u001b[0;32m      <a href='vscode-notebook-cell:/c%3A/Users/Dee/root/Projects/dev/cran2graph/scripts/02_Loading_Data_Neo4j.ipynb#X11sZmlsZQ%3D%3D?line=3'>4</a>\u001b[0m \u001b[39mLOAD CSV WITH HEADERS FROM \u001b[39m\u001b[39m'\u001b[39m\u001b[39mfile:///cran_df.csv\u001b[39m\u001b[39m'\u001b[39m\u001b[39m AS row\u001b[39m\n\u001b[1;32m   (...)\u001b[0m\n\u001b[0;32m     <a href='vscode-notebook-cell:/c%3A/Users/Dee/root/Projects/dev/cran2graph/scripts/02_Loading_Data_Neo4j.ipynb#X11sZmlsZQ%3D%3D?line=28'>29</a>\u001b[0m \u001b[39m} IN TRANSACTIONS OF 10000 ROWS;\u001b[39m\n\u001b[0;32m     <a href='vscode-notebook-cell:/c%3A/Users/Dee/root/Projects/dev/cran2graph/scripts/02_Loading_Data_Neo4j.ipynb#X11sZmlsZQ%3D%3D?line=29'>30</a>\u001b[0m \u001b[39m\"\"\"\u001b[39m\n\u001b[0;32m     <a href='vscode-notebook-cell:/c%3A/Users/Dee/root/Projects/dev/cran2graph/scripts/02_Loading_Data_Neo4j.ipynb#X11sZmlsZQ%3D%3D?line=30'>31</a>\u001b[0m \u001b[39mprint\u001b[39m(\u001b[39mf\u001b[39m\u001b[39m\"\u001b[39m\u001b[39mloading query....\u001b[39m\u001b[39m\"\u001b[39m)\n\u001b[1;32m---> <a href='vscode-notebook-cell:/c%3A/Users/Dee/root/Projects/dev/cran2graph/scripts/02_Loading_Data_Neo4j.ipynb#X11sZmlsZQ%3D%3D?line=31'>32</a>\u001b[0m connection\u001b[39m.\u001b[39;49mquery(db\u001b[39m=\u001b[39;49m\u001b[39m\"\u001b[39;49m\u001b[39mneo4j\u001b[39;49m\u001b[39m\"\u001b[39;49m, query\u001b[39m=\u001b[39;49mload_package_query)\n\u001b[0;32m     <a href='vscode-notebook-cell:/c%3A/Users/Dee/root/Projects/dev/cran2graph/scripts/02_Loading_Data_Neo4j.ipynb#X11sZmlsZQ%3D%3D?line=32'>33</a>\u001b[0m connection\u001b[39m.\u001b[39mclose()\n\u001b[0;32m     <a href='vscode-notebook-cell:/c%3A/Users/Dee/root/Projects/dev/cran2graph/scripts/02_Loading_Data_Neo4j.ipynb#X11sZmlsZQ%3D%3D?line=33'>34</a>\u001b[0m \u001b[39mprint\u001b[39m(\u001b[39mf\u001b[39m\u001b[39m\"\u001b[39m\u001b[39mend operation....\u001b[39m\u001b[39m\"\u001b[39m)\n",
      "File \u001b[1;32mc:\\Users\\Dee\\root\\Projects\\dev\\cran2graph\\scripts\\graphutils\\utils.py:12\u001b[0m, in \u001b[0;36mNeo4jConnect.query\u001b[1;34m(self, db, query)\u001b[0m\n\u001b[0;32m     10\u001b[0m \u001b[39mdef\u001b[39;00m \u001b[39mquery\u001b[39m(\u001b[39mself\u001b[39m, db, query):\n\u001b[0;32m     11\u001b[0m     session \u001b[39m=\u001b[39m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39mdriver\u001b[39m.\u001b[39msession(database\u001b[39m=\u001b[39mdb)\n\u001b[1;32m---> 12\u001b[0m     result \u001b[39m=\u001b[39m session\u001b[39m.\u001b[39;49mrun(query)\n\u001b[0;32m     13\u001b[0m     \u001b[39mreturn\u001b[39;00m result\n",
      "File \u001b[1;32mc:\\Users\\Dee\\root\\Projects\\dev\\cran2graph\\venv\\Lib\\site-packages\\neo4j\\_sync\\work\\session.py:314\u001b[0m, in \u001b[0;36mSession.run\u001b[1;34m(self, query, parameters, **kwargs)\u001b[0m\n\u001b[0;32m    312\u001b[0m bookmarks \u001b[39m=\u001b[39m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_get_bookmarks()\n\u001b[0;32m    313\u001b[0m parameters \u001b[39m=\u001b[39m \u001b[39mdict\u001b[39m(parameters \u001b[39mor\u001b[39;00m {}, \u001b[39m*\u001b[39m\u001b[39m*\u001b[39mkwargs)\n\u001b[1;32m--> 314\u001b[0m \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_auto_result\u001b[39m.\u001b[39;49m_run(\n\u001b[0;32m    315\u001b[0m     query, parameters, \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_config\u001b[39m.\u001b[39;49mdatabase,\n\u001b[0;32m    316\u001b[0m     \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_config\u001b[39m.\u001b[39;49mimpersonated_user, \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_config\u001b[39m.\u001b[39;49mdefault_access_mode,\n\u001b[0;32m    317\u001b[0m     bookmarks, \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_config\u001b[39m.\u001b[39;49mnotifications_min_severity,\n\u001b[0;32m    318\u001b[0m     \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_config\u001b[39m.\u001b[39;49mnotifications_disabled_categories,\n\u001b[0;32m    319\u001b[0m )\n\u001b[0;32m    321\u001b[0m \u001b[39mreturn\u001b[39;00m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_auto_result\n",
      "File \u001b[1;32mc:\\Users\\Dee\\root\\Projects\\dev\\cran2graph\\venv\\Lib\\site-packages\\neo4j\\_sync\\work\\result.py:166\u001b[0m, in \u001b[0;36mResult._run\u001b[1;34m(self, query, parameters, db, imp_user, access_mode, bookmarks, notifications_min_severity, notifications_disabled_categories)\u001b[0m\n\u001b[0;32m    164\u001b[0m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_pull()\n\u001b[0;32m    165\u001b[0m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_connection\u001b[39m.\u001b[39msend_all()\n\u001b[1;32m--> 166\u001b[0m \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_attach()\n",
      "File \u001b[1;32mc:\\Users\\Dee\\root\\Projects\\dev\\cran2graph\\venv\\Lib\\site-packages\\neo4j\\_sync\\work\\result.py:274\u001b[0m, in \u001b[0;36mResult._attach\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    272\u001b[0m \u001b[39mif\u001b[39;00m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_exhausted \u001b[39mis\u001b[39;00m \u001b[39mFalse\u001b[39;00m:\n\u001b[0;32m    273\u001b[0m     \u001b[39mwhile\u001b[39;00m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_attached \u001b[39mis\u001b[39;00m \u001b[39mFalse\u001b[39;00m:\n\u001b[1;32m--> 274\u001b[0m         \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_connection\u001b[39m.\u001b[39;49mfetch_message()\n",
      "File \u001b[1;32mc:\\Users\\Dee\\root\\Projects\\dev\\cran2graph\\venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_common.py:180\u001b[0m, in \u001b[0;36mConnectionErrorHandler.__getattr__.<locals>.outer.<locals>.inner\u001b[1;34m(*args, **kwargs)\u001b[0m\n\u001b[0;32m    178\u001b[0m \u001b[39mdef\u001b[39;00m \u001b[39minner\u001b[39m(\u001b[39m*\u001b[39margs, \u001b[39m*\u001b[39m\u001b[39m*\u001b[39mkwargs):\n\u001b[0;32m    179\u001b[0m     \u001b[39mtry\u001b[39;00m:\n\u001b[1;32m--> 180\u001b[0m         func(\u001b[39m*\u001b[39;49margs, \u001b[39m*\u001b[39;49m\u001b[39m*\u001b[39;49mkwargs)\n\u001b[0;32m    181\u001b[0m     \u001b[39mexcept\u001b[39;00m (Neo4jError, ServiceUnavailable, SessionExpired) \u001b[39mas\u001b[39;00m exc:\n\u001b[0;32m    182\u001b[0m         \u001b[39massert\u001b[39;00m \u001b[39mnot\u001b[39;00m asyncio\u001b[39m.\u001b[39miscoroutinefunction(\u001b[39mself\u001b[39m\u001b[39m.\u001b[39m__on_error)\n",
      "File \u001b[1;32mc:\\Users\\Dee\\root\\Projects\\dev\\cran2graph\\venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_bolt.py:851\u001b[0m, in \u001b[0;36mBolt.fetch_message\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    847\u001b[0m \u001b[39m# Receive exactly one message\u001b[39;00m\n\u001b[0;32m    848\u001b[0m tag, fields \u001b[39m=\u001b[39m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39minbox\u001b[39m.\u001b[39mpop(\n\u001b[0;32m    849\u001b[0m     hydration_hooks\u001b[39m=\u001b[39m\u001b[39mself\u001b[39m\u001b[39m.\u001b[39mresponses[\u001b[39m0\u001b[39m]\u001b[39m.\u001b[39mhydration_hooks\n\u001b[0;32m    850\u001b[0m )\n\u001b[1;32m--> 851\u001b[0m res \u001b[39m=\u001b[39m \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_process_message(tag, fields)\n\u001b[0;32m    852\u001b[0m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39midle_since \u001b[39m=\u001b[39m perf_counter()\n\u001b[0;32m    853\u001b[0m \u001b[39mreturn\u001b[39;00m res\n",
      "File \u001b[1;32mc:\\Users\\Dee\\root\\Projects\\dev\\cran2graph\\venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_bolt5.py:376\u001b[0m, in \u001b[0;36mBolt5x0._process_message\u001b[1;34m(self, tag, fields)\u001b[0m\n\u001b[0;32m    374\u001b[0m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_server_state_manager\u001b[39m.\u001b[39mstate \u001b[39m=\u001b[39m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39mbolt_states\u001b[39m.\u001b[39mFAILED\n\u001b[0;32m    375\u001b[0m \u001b[39mtry\u001b[39;00m:\n\u001b[1;32m--> 376\u001b[0m     response\u001b[39m.\u001b[39;49mon_failure(summary_metadata \u001b[39mor\u001b[39;49;00m {})\n\u001b[0;32m    377\u001b[0m \u001b[39mexcept\u001b[39;00m (ServiceUnavailable, DatabaseUnavailable):\n\u001b[0;32m    378\u001b[0m     \u001b[39mif\u001b[39;00m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39mpool:\n",
      "File \u001b[1;32mc:\\Users\\Dee\\root\\Projects\\dev\\cran2graph\\venv\\Lib\\site-packages\\neo4j\\_sync\\io\\_common.py:247\u001b[0m, in \u001b[0;36mResponse.on_failure\u001b[1;34m(self, metadata)\u001b[0m\n\u001b[0;32m    245\u001b[0m handler \u001b[39m=\u001b[39m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39mhandlers\u001b[39m.\u001b[39mget(\u001b[39m\"\u001b[39m\u001b[39mon_summary\u001b[39m\u001b[39m\"\u001b[39m)\n\u001b[0;32m    246\u001b[0m Util\u001b[39m.\u001b[39mcallback(handler)\n\u001b[1;32m--> 247\u001b[0m \u001b[39mraise\u001b[39;00m Neo4jError\u001b[39m.\u001b[39mhydrate(\u001b[39m*\u001b[39m\u001b[39m*\u001b[39mmetadata)\n",
      "\u001b[1;31mCypherSyntaxError\u001b[0m: {code: Neo.ClientError.Statement.SyntaxError} {message: Invalid input 'latestPublishedDate': expected\r\n  \"!=\"\r\n  \"%\"\r\n  \"*\"\r\n  \"+\"\r\n  \",\"\r\n  \"-\"\r\n  \"/\"\r\n  \"::\"\r\n  \"<\"\r\n  \"<=\"\r\n  \"<>\"\r\n  \"=\"\r\n  \"=~\"\r\n  \">\"\r\n  \">=\"\r\n  \"AND\"\r\n  \"CALL\"\r\n  \"CONTAINS\"\r\n  \"CREATE\"\r\n  \"DELETE\"\r\n  \"DETACH\"\r\n  \"ENDS\"\r\n  \"FOREACH\"\r\n  \"IN\"\r\n  \"IS\"\r\n  \"LOAD\"\r\n  \"MATCH\"\r\n  \"MERGE\"\r\n  \"ON\"\r\n  \"OPTIONAL\"\r\n  \"OR\"\r\n  \"REMOVE\"\r\n  \"RETURN\"\r\n  \"SET\"\r\n  \"STARTS\"\r\n  \"UNION\"\r\n  \"UNWIND\"\r\n  \"USE\"\r\n  \"WITH\"\r\n  \"XOR\"\r\n  \"^\"\r\n  \"}\" (line 20, column 9 (offset: 533))\r\n\"        latestPublishedDate = row.published_date\"\r\n         ^}"
     ]
    }
   ],
   "source": [
    "# ## Loading package nodes from csv file\n",
    "# load_package_query = \"\"\"\n",
    "# // Load 'Package' nodes from the CSV file\n",
    "# LOAD CSV WITH HEADERS FROM 'file:///cran_df.csv' AS row\n",
    "# CALL {\n",
    "#     WITH row\n",
    "#     MERGE (p:Package {\n",
    "#         name: row.package,\n",
    "#         version: row.version,\n",
    "#         license: row.license,\n",
    "#         md5sum: row.md5sum,\n",
    "#         description: row.description,\n",
    "#         latestPublishedDate: row.published_date\n",
    "#     })\n",
    "#     ON CREATE SET\n",
    "#         name = row.package,\n",
    "#         version = row.version,\n",
    "#         license = row.license,\n",
    "#         md5sum = row.md5sum,\n",
    "#         description = row.description\n",
    "#         latestPublishedDate = row.published_date\n",
    "#     ON MATCH SET\n",
    "#         name = row.package,\n",
    "#         version = row.version,\n",
    "#         license = row.license,\n",
    "#         md5sum = row.md5sum,\n",
    "#         description = row.description\n",
    "#         latestPublishedDate = row.published_date\n",
    "# } IN TRANSACTIONS OF 10000 ROWS;\n",
    "# \"\"\"\n",
    "# print(f\"loading query....\")\n",
    "# connection.query(db=\"neo4j\", query=load_package_query)\n",
    "# connection.close()\n",
    "# print(f\"end operation....\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "loading query....\n",
      "end operation....\n"
     ]
    }
   ],
   "source": [
    "## working comment\n",
    "## Loading person nodes from csv file\n",
    "load_person_query = \"\"\"\n",
    "// Load 'person' nodes from the CSV file\n",
    "LOAD CSV WITH HEADERS FROM 'file:///cran_df.csv' AS row\n",
    "CALL {\n",
    "    WITH row\n",
    "    MERGE (a:Person {\n",
    "        name: COALESCE(row.author, \"N/A\")\n",
    "    })\n",
    "} IN TRANSACTIONS OF 10000 ROWS;\n",
    "\"\"\"\n",
    "print(f\"loading query....\")\n",
    "connection.query(db=\"neo4j\", query=load_person_query)\n",
    "connection.close()\n",
    "print(f\"end operation....\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "loading query....\n",
      "end operation....\n"
     ]
    }
   ],
   "source": [
    "## working comment\n",
    "## Loading imports nodes from csv file\n",
    "load_import_query = \"\"\"\n",
    "// Load 'person' nodes from the CSV file\n",
    "LOAD CSV WITH HEADERS FROM 'file:///cran_df.csv' AS row\n",
    "CALL {\n",
    "    WITH row\n",
    "    MERGE (p:Package {\n",
    "        name: COALESCE(row.imports, \"N/A\")\n",
    "    })\n",
    "} IN TRANSACTIONS OF 10000 ROWS;\n",
    "\"\"\"\n",
    "print(f\"loading query....\")\n",
    "connection.query(db=\"neo4j\", query=load_import_query)\n",
    "connection.close()\n",
    "print(f\"end operation....\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "loading query....\n",
      "end operation....\n"
     ]
    }
   ],
   "source": [
    "## THis fix the issue\n",
    "## Loading package nodes from csv file\n",
    "## Loading person nodes from csv file\n",
    "load_license_query = \"\"\"\n",
    "// Load 'person' nodes from the CSV file\n",
    "LOAD CSV WITH HEADERS FROM 'file:///cran_df.csv' AS row\n",
    "CALL {\n",
    "    WITH row\n",
    "    MERGE (l:License {\n",
    "        type: COALESCE(row.license, \"N/A\")\n",
    "    })\n",
    "} IN TRANSACTIONS OF 10000 ROWS;\n",
    "\"\"\"\n",
    "print(f\"loading query....\")\n",
    "connection.query(db=\"neo4j\", query=load_license_query)\n",
    "connection.close()\n",
    "print(f\"end operation....\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "loading query....\n",
      "end operation....\n"
     ]
    }
   ],
   "source": [
    "## THis fix the issue\n",
    "## Loading package nodes from csv file\n",
    "## Loading person nodes from csv file\n",
    "load_institution_query = \"\"\"\n",
    "// Load 'person' nodes from the CSV file\n",
    "LOAD CSV WITH HEADERS FROM 'file:///cran_df.csv' AS row\n",
    "CALL {\n",
    "    WITH row\n",
    "    MERGE (i:Institution {\n",
    "        type: COALESCE(row.institution, \"N/A\")\n",
    "    })\n",
    "} IN TRANSACTIONS OF 10000 ROWS;\n",
    "\"\"\"\n",
    "print(f\"loading query....\")\n",
    "connection.query(db=\"neo4j\", query=load_institution_query)\n",
    "connection.close()\n",
    "print(f\"end operation....\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "loading query....\n",
      "end operation....\n"
     ]
    }
   ],
   "source": [
    "## THis fix the issue\n",
    "## Loading package nodes from csv file\n",
    "## Loading person nodes from csv file\n",
    "load_organization_query = \"\"\"\n",
    "// Load 'person' nodes from the CSV file\n",
    "LOAD CSV WITH HEADERS FROM 'file:///cran_df.csv' AS row\n",
    "CALL {\n",
    "    WITH row\n",
    "    MERGE (o:Organization {\n",
    "        name: COALESCE(row.sponsor, \"N/A\")\n",
    "    })\n",
    "} IN TRANSACTIONS OF 10000 ROWS;\n",
    "\"\"\"\n",
    "print(f\"loading query....\")\n",
    "connection.query(db=\"neo4j\", query=load_organization_query)\n",
    "connection.close()\n",
    "print(f\"end operation....\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "loading query....\n",
      "end operation....\n"
     ]
    }
   ],
   "source": [
    "## Loading contributed_to relationships\n",
    "rel_contributed_to_query = \"\"\"\n",
    "// Load 'person' nodes from the CSV file\n",
    "LOAD CSV WITH HEADERS FROM 'file:///cran_df.csv' AS row\n",
    "MATCH (p:Package { name: row.package })\n",
    "MATCH (a:Person { name: COALESCE(row.author, \"N/A\")})\n",
    "\n",
    "MERGE (a)-[:CONTRIBUTED_TO]->(p);\n",
    "\n",
    "\"\"\"\n",
    "print(f\"loading query....\")\n",
    "connection.query(\"neo4j\", rel_contributed_to_query)\n",
    "connection.close()\n",
    "print(f\"end operation....\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "loading query....\n",
      "end operation....\n"
     ]
    }
   ],
   "source": [
    "## Loading contributed_to relationships\n",
    "rel_maintains_query = \"\"\"\n",
    "// Load 'person' nodes from the CSV file\n",
    "LOAD CSV WITH HEADERS FROM 'file:///cran_df.csv' AS row\n",
    "MATCH (p:Package { name: row.package })\n",
    "MATCH (a:Person { name: COALESCE(row.maintainer_name,\"N/A\")})\n",
    "\n",
    "MERGE (a)-[:MAINTAINS]->(p);\n",
    "\n",
    "\"\"\"\n",
    "print(f\"loading query....\")\n",
    "connection.query(\"neo4j\", rel_maintains_query)\n",
    "connection.close()\n",
    "print(f\"end operation....\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "loading query....\n",
      "end operation....\n"
     ]
    }
   ],
   "source": [
    "## Loading contributed_to relationships\n",
    "rel_license_query = \"\"\"\n",
    "// Load 'person' nodes from the CSV file\n",
    "LOAD CSV WITH HEADERS FROM 'file:///cran_df.csv' AS row\n",
    "MATCH (p:Package { name: row.package })\n",
    "MATCH (l:License { type: COALESCE(row.license,\"N/A\")})\n",
    "\n",
    "MERGE (p)-[:LICENSE_BY]-(l);\n",
    "\n",
    "\"\"\"\n",
    "print(f\"loading query....\")\n",
    "connection.query(\"neo4j\",rel_license_query)\n",
    "connection.close()\n",
    "print(f\"end operation....\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "loading query....\n",
      "end operation....\n"
     ]
    }
   ],
   "source": [
    "## Loading contributed_to relationships\n",
    "rel_organization_query = \"\"\"\n",
    "// Load 'person' nodes from the CSV file\n",
    "LOAD CSV WITH HEADERS FROM 'file:///cran_df.csv' AS row\n",
    "MATCH (p:Package { name: COALESCE(row.package,\"N/A\")})\n",
    "MATCH (o:Organization { name: COALESCE(row.sponsor ,\"N/A\")})\n",
    "\n",
    "MERGE (p)-[:SUPPORTED_BY]->(o);\n",
    "\n",
    "\"\"\"\n",
    "print(f\"loading query....\")\n",
    "connection.query(\"neo4j\",rel_organization_query)\n",
    "connection.close()\n",
    "print(f\"end operation....\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "loading query....\n",
      "end operation....\n"
     ]
    }
   ],
   "source": [
    "## Loading contributed_to relationships\n",
    "rel_institution_query = \"\"\"\n",
    "// Load 'person' nodes from the CSV file\n",
    "LOAD CSV WITH HEADERS FROM 'file:///cran_df.csv' AS row\n",
    "MATCH (a:Person { name: COALESCE(row.maintainer_name,\"N/A\")})\n",
    "MATCH (i:Institution { type: COALESCE(row.institution ,\"N/A\")})\n",
    "\n",
    "MERGE (a)-[:WORKS_AT]->(i);\n",
    "\n",
    "\"\"\"\n",
    "print(f\"loading query....\")\n",
    "connection.query(\"neo4j\",rel_institution_query)\n",
    "connection.close()\n",
    "print(f\"end operation....\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "loading query....\n",
      "end operation....\n"
     ]
    }
   ],
   "source": [
    "## Loading contributed_to relationships\n",
    "rel_dependency_query = \"\"\"\n",
    "// Load 'person' nodes from the CSV file\n",
    "LOAD CSV WITH HEADERS FROM 'file:///cran_df.csv' AS row\n",
    "MATCH (p:Package { name: row.package })\n",
    "MATCH (d:Package { name: COALESCE(row.imports,\"N/A\")})\n",
    "\n",
    "MERGE (p)-[:DEPENDS_ON]->(d);\n",
    "\n",
    "\"\"\"\n",
    "print(f\"loading query....\")\n",
    "connection.query(\"neo4j\", rel_dependency_query)\n",
    "connection.close()\n",
    "print(f\"end operation....\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\Dee\\AppData\\Local\\Temp\\ipykernel_92308\\1262747138.py:21: DeprecationWarning: read_transaction has been renamed to execute_read\n",
      "  data = session.read_transaction(get_package_data)\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'p.package': 'A3', 'p.description': 'Supplies tools for tabulating and analyzing the results of predictive models. The methods employed are applicable to virtually any predictive model and make comparisons between different methodologies straightforward.'}, {'p.package': 'AalenJohansen', 'p.description': 'Provides the conditional Nelson-Aalen and Aalen-Johansen estimators. The methods are based on Bladt & Furrer (2023), in preparation.'}, {'p.package': 'AATtools', 'p.description': 'Compute approach bias scores using different scoring algorithms,\\n    compute bootstrapped and exact split-half reliability estimates,\\n    and compute confidence intervals for individual participant scores.'}, {'p.package': 'ABACUS', 'p.description': 'A set of Shiny apps for effective communication and understanding in statistics. The current version includes properties of normal distribution, properties of sampling distribution, one-sample z and t tests, two samples independent (unpaired) t test and analysis of variance.'}, {'p.package': 'abasequence', 'p.description': 'Provides a suite of functions for analyzing sequences of events. Users can generate and code sequences based on predefined rules, with a special focus on the identification of sequences coded as ABA (when one element appears, followed by a different one, and then followed by the first). Additionally, the package offers the ability to calculate the length of consecutive ABA-coded sequences sharing common elements. The methods implemented in this package are based on the work by Ziembowicz, K., Rychwalska, A., & Nowak, A. (2022). <doi:10.1177/10464964221118674>.'}, {'p.package': 'abbreviate', 'p.description': 'Strings are abbreviated to at least minlength characters, such that they remain unique \\n    (if they were). The abbreviations should be recognisable.'}, {'p.package': 'abbyyR', 'p.description': 'Get text from images of text using Abbyy Cloud Optical Character\\n    Recognition (OCR) API. Easily OCR images, barcodes, forms, documents with\\n    machine readable zones, e.g. passports. Get the results in a variety of formats\\n    including plain text and XML. To learn more about the Abbyy OCR API, see \\n    <http://ocrsdk.com/>.'}, {'p.package': 'abc', 'p.description': 'Implements several ABC algorithms for\\n        performing parameter estimation, model selection, and goodness-of-fit.\\n        Cross-validation tools are also available for measuring the\\n        accuracy of ABC estimates, and to calculate the\\n        misclassification probabilities of different models.'}, {'p.package': 'abc.data', 'p.description': 'Contains data which are used by functions of the abc package.'}, {'p.package': 'ABC.RAP', 'p.description': 'It aims to identify candidate genes that are differentially\\n    methylated between cases and controls. It applies Students t-test and delta beta analysis to\\n    identify candidate genes containing multiple CpG sites.'}, {'p.package': 'ABCanalysis', 'p.description': 'For a given data set, the package provides a novel method of computing precise limits to acquire subsets which are easily interpreted. Closely related to the Lorenz curve, the ABC curve visualizes the data by graphically representing the cumulative distribution function. Based on an ABC analysis the algorithm calculates, with the help of the ABC curve, the optimal limits by exploiting the mathematical properties pertaining to distribution of analyzed items. The data containing positive values is divided into three disjoint subsets A, B and C, with subset A comprising very profitable values, i.e. largest data values (the important few), subset B comprising values where the yield equals to the effort required to obtain it, and the subset C comprising of non-profitable values, i.e., the smallest data sets (the trivial many). Package is based on Computed ABC Analysis for rational Selection of most informative Variables in multivariate Data, PLoS One. Ultsch. A., Lotsch J. (2015) <DOI:10.1371/journal.pone.0129767>.'}, {'p.package': 'abclass', 'p.description': 'Multi-category angle-based large-margin classifiers.\\n    See Zhang and Liu (2014) <doi:10.1093/biomet/asu017> for details.'}, {'p.package': 'ABCoptim', 'p.description': 'An implementation of Karaboga (2005) Artificial Bee Colony\\n    Optimization algorithm <http://mf.erciyes.edu.tr/abc/pub/tr06_2005.pdf>.\\n    This (working) version is a Work-in-progress, which is\\n    why it has been implemented using pure R code. This was developed upon the basic\\n    version programmed in C and distributed at the algorithms official website.'}, {'p.package': 'ABCp2', 'p.description': 'Tests the goodness of fit of a distribution of offspring to the Normal, Poisson, and Gamma distribution and estimates the proportional paternity of the second male (P2) based on the best fit distribution.'}, {'p.package': 'abcrf', 'p.description': 'Performs Approximate Bayesian Computation (ABC) model choice and parameter inference via random forests.\\n  Pudlo P., Marin J.-M., Estoup A., Cornuet J.-M., Gautier M. and Robert C. P. (2016) <doi:10.1093/bioinformatics/btv684>.\\n  Estoup A., Raynal L., Verdu P. and Marin J.-M. <http://journal-sfds.fr/article/view/709>.\\n  Raynal L., Marin J.-M., Pudlo P., Ribatet M., Robert C. P. and Estoup A. (2019) <doi:10.1093/bioinformatics/bty867>.'}, {'p.package': 'abcrlda', 'p.description': 'Offers methods to perform asymptotically bias-corrected regularized linear discriminant analysis (ABC_RLDA) for cost-sensitive binary classification. The bias-correction is an estimate of the bias term added to regularized discriminant analysis (RLDA) that minimizes the overall risk. The default magnitude of misclassification costs are equal and set to 0.5; however, the package also offers the options to set them to some predetermined values or, alternatively, take them as hyperparameters to tune.\\n    A. Zollanvari, M. Abdirash, A. Dadlani and B. Abibullaev (2019) <doi:10.1109/LSP.2019.2918485>.'}, {'p.package': 'abctools', 'p.description': 'Tools for approximate Bayesian computation including summary statistic selection and assessing coverage.\\n    See Nunes and Prangle (2015) <doi:10.32614/RJ-2015-030> and Rodrigues, Prangle and Sisson (2018) <doi:10.1016/j.csda.2018.04.004>.'}, {'p.package': 'abd', 'p.description': 'The abd package contains data sets and sample code for The\\n    Analysis of Biological Data by Michael Whitlock and Dolph Schluter (2009;\\n    Roberts & Company Publishers).'}, {'p.package': 'abdiv', 'p.description': 'A collection of measures for measuring ecological diversity.\\n  Ecological diversity comes in two flavors: alpha diversity measures the\\n  diversity within a single site or sample, and beta diversity measures the\\n  diversity across two sites or samples. This package overlaps considerably\\n  with other R packages such as vegan, gUniFrac, betapart, and fossil.\\n  We also include a wide range of functions that are implemented in software\\n  outside the R ecosystem, such as scipy, Mothur, and scikit-bio.  The\\n  implementations here are designed to be basic and clear to the reader.'}, {'p.package': 'abe', 'p.description': 'Performs augmented backward elimination and checks the stability of the obtained model. Augmented backward elimination combines significance or information based criteria with the change in estimate to either select the optimal model for prediction purposes or to serve as a tool to obtain a practically sound, highly interpretable model. More details can be found in Dunkler et al. (2014) <doi:10.1371/journal.pone.0113677>.'}, {'p.package': 'abess', 'p.description': 'Extremely efficient toolkit for solving the best subset selection problem <https://www.jmlr.org/papers/v23/21-1060.html>. This package is its R interface. The package implements and generalizes algorithms designed in <doi:10.1073/pnas.2014241117> that exploits a novel sequencing-and-splicing technique to guarantee exact support recovery and globally optimal solution in polynomial times for linear model. It also supports best subset selection for logistic regression, Poisson regression, Cox proportional hazard model, Gamma regression, multiple-response regression, multinomial logistic regression, ordinal regression, (sequential) principal component analysis, and robust principal component analysis. The other valuable features such as the best subset of group selection <doi:10.1287/ijoc.2022.1241> and sure independence screening <doi:10.1111/j.1467-9868.2008.00674.x> are also provided.'}, {'p.package': 'abglasso', 'p.description': 'Implements a Bayesian adaptive graphical lasso data-augmented block Gibbs sampler. The sampler simulates the posterior distribution of precision matrices of a Gaussian Graphical Model. This sampler was adapted from the original MATLAB routine proposed in Wang (2012) <doi:10.1214/12-BA729>.'}, {'p.package': 'ABHgenotypeR', 'p.description': 'Easy to use functions to visualize marker data\\n    from biparental populations. Useful for both analyzing and\\n    presenting genotypes in the ABH format.'}, {'p.package': 'abind', 'p.description': 'Combine multidimensional arrays into a single array.\\n  This is a generalization of cbind and rbind.  Works with\\n  vectors, matrices, and higher-dimensional arrays.  Also\\n  provides functions adrop, asub, and afill for manipulating,\\n  extracting and replacing data in arrays.'}, {'p.package': 'abjData', 'p.description': 'The Brazilian Jurimetrics Association (ABJ in\\n    Portuguese, see <https://abj.org.br/> for more information) is\\n    a non-profit organization which aims to investigate and promote the\\n    use of statistics and probability in the study of Law and its\\n    institutions. This package has a set of datasets commonly used in\\n    our book.'}]\n"
     ]
    }
   ],
   "source": [
    "import igraph\n",
    "from neo4j import GraphDatabase\n",
    "\n",
    "# Define a function to retrieve data from Neo4j\n",
    "def get_package_data(tx):\n",
    "    query = \"MATCH (p:Package) RETURN p.package, p.description limit 25\"\n",
    "    result = tx.run(query)\n",
    "    return result.data()\n",
    "\n",
    "# Connect to your Neo4j database\n",
    "uri = \"neo4j://localhost:7687\"\n",
    "username = \"admin\"\n",
    "password = \"cran2graph\"\n",
    "\n",
    "# Create a Neo4j driver\n",
    "driver = GraphDatabase.driver(uri, auth=(username, password))\n",
    "\n",
    "\n",
    "# Retrieve package data from Neo4j\n",
    "with driver.session(database=\"cran\") as session:\n",
    "    data = session.read_transaction(get_package_data)\n",
    "\n",
    "# Preprocess the input text (e.g., remove stopwords and tokenize)\n",
    "input_text = \"package to perform data transformation and cleaning\"\n",
    "\n",
    "# Create a list of package descriptions\n",
    "package_descriptions = [package[\"description\"] for package in data]"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
